{
  "queue": [],
  "running": [],
  "completed": [
    {
      "id": "T1-002",
      "type": "blog",
      "source": {
        "id": "T1-002",
        "title": "The Intelligence Age",
        "type": "blog",
        "url": "https://ia.samaltman.com/",
        "tier": 1,
        "priority": "CRITICAL",
        "estimated_pages": 4,
        "temporal_period": "OpenAI CEO (2024)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760221906953,
      "updated_at": 1760221907744,
      "result": {
        "source_id": "T1-002",
        "platform": "generic",
        "markdown": "---\ntitle: \"The Intelligence Age\"\nurl: https://ia.samaltman.com/\nplatform: generic\nsource_type: blog\nextracted: 2025-10-11T22:31:47.743Z\nextraction_method: generic\n---\n\n*\\[Image: A vibrant, impressionistic landscape of a winding path that stretches towards the horizon, lined with colorful fields\\]*\n\nIn the next couple of decades, we will be able to do things that would have seemed like magic to our grandparents.\n\nThis phenomenon is not new, but it will be newly accelerated. People have become dramatically more capable over time; we can already accomplish things now that our predecessors would have believed to be impossible.\n\nWe are more capable not because of genetic change, but because we benefit from the infrastructure of society being way smarter and more capable than any one of us; in an important sense, society itself is a form of advanced intelligence. Our grandparents – and the generations that came before them – built and achieved great things. They contributed to the scaffolding of human progress that we all benefit from. AI will give people tools to solve hard problems and help us add new struts to that scaffolding that we couldn’t have figured out on our own. The story of progress will continue, and our children will be able to do things we can’t.\n\nIt won’t happen all at once, but we’ll soon be able to work with AI that helps us accomplish much more than we ever could without AI; eventually we can each have a personal AI team, full of virtual experts in different areas, working together to create almost anything we can imagine. Our children will have virtual tutors who can provide personalized instruction in any subject, in any language, and at whatever pace they need. We can imagine similar ideas for better healthcare, the ability to create any kind of software someone can imagine, and much more.\n\nWith these new abilities, we can have shared prosperity to a degree that seems unimaginable today; in the future, everyone’s lives can be better than anyone’s life is now. Prosperity alone doesn’t necessarily make people happy – there are plenty of miserable rich people – but it would meaningfully improve the lives of people around the world.\n\nHere is one narrow way to look at human history: after thousands of years of compounding scientific discovery and technological progress, we have figured out how to melt sand, add some impurities, arrange it with astonishing precision at extraordinarily tiny scale into computer chips, run energy through it, and end up with systems capable of creating increasingly capable artificial intelligence.\n\nThis may turn out to be the most consequential fact about all of history so far. It is possible that we will have superintelligence in a few thousand days (!); it may take longer, but I’m confident we’ll get there.\n\nHow did we get to the doorstep of the next leap in prosperity?\n\nIn three words: deep learning worked.\n\nIn 15 words: deep learning worked, got predictably better with scale, and we dedicated increasing resources to it.\n\nThat’s really it; humanity discovered an algorithm that could really, truly learn any distribution of data (or really, the underlying “rules” that produce any distribution of data). To a shocking degree of precision, the more compute and data available, the better it gets at helping people solve hard problems. I find that no matter how much time I spend thinking about this, I can never really internalize how consequential it is.\n\nThere are a lot of details we still have to figure out, but it’s a mistake to get distracted by any particular challenge. Deep learning works, and we will solve the remaining problems. We can say a lot of things about what may happen next, but the main one is that AI is going to get better with scale, and that will lead to meaningful improvements to the lives of people around the world.\n\nAI models will soon serve as autonomous personal assistants who carry out specific tasks on our behalf like coordinating medical care on your behalf. At some point further down the road, AI systems are going to get so good that they help us make better next-generation systems and make scientific progress across the board.\n\nTechnology brought us from the Stone Age to the Agricultural Age and then to the Industrial Age. From here, the path to the Intelligence Age is paved with compute, energy, and human will.\n\nIf we want to put AI into the hands of as many people as possible, we need to drive down the cost of compute and make it abundant (which requires lots of energy and chips). If we don’t build enough infrastructure, AI will be a very limited resource that wars get fought over and that becomes mostly a tool for rich people.\n\nWe need to act wisely but with conviction. The dawn of the Intelligence Age is a momentous development with very complex and extremely high-stakes challenges. It will not be an entirely positive story, but the upside is so tremendous that we owe it to ourselves, and the future, to figure out how to navigate the risks in front of us.\n\nI believe the future is going to be so bright that no one can do it justice by trying to write about it now; a defining characteristic of the Intelligence Age will be massive prosperity.\n\nAlthough it will happen incrementally, astounding triumphs – fixing the climate, establishing a space colony, and the discovery of all of physics – will eventually become commonplace. With nearly-limitless intelligence and abundant energy – the ability to generate great ideas, and the ability to make them happen – we can do quite a lot.\n\nAs we have seen with other technologies, there will also be downsides, and we need to start working now to maximize AI’s benefits while minimizing its harms. As one example, we expect that this technology can cause a significant change in labor markets (good and bad) in the coming years, but most jobs will change more slowly than most people think, and I have no fear that we’ll run out of things to do (even if they don’t look like “real jobs” to us today). People have an innate desire to create and to be useful to each other, and AI will allow us to amplify our own abilities like never before. As a society, we will be back in an expanding world, and we can again focus on playing positive-sum games.\n\nMany of the jobs we do today would have looked like trifling wastes of time to people a few hundred years ago, but nobody is looking back at the past, wishing they were a lamplighter. If a lamplighter could see the world today, he would think the prosperity all around him was unimaginable. And if we could fast-forward a hundred years from today, the prosperity all around us would feel just as unimaginable.",
        "metadata": {
          "url": "https://ia.samaltman.com/",
          "platform": "generic",
          "title": "The Intelligence Age",
          "author": null,
          "excerpt": "In the next couple of decades, we will be able to do things that would have seemed like magic to our grandparents.",
          "length": 6328,
          "site_name": null,
          "extraction_method": "readability"
        },
        "output_path": "/Users/oalanicolas/Documents/Code/mente_lendaria/docs/minds/sam_altman/sources/downloads/blogs/T1-002.md",
        "validation": {
          "score": 70,
          "acceptable": true,
          "issues": [
            "Missing author and date",
            "Low markdown quality: 40"
          ],
          "markdownQuality": {
            "score": 40,
            "wordCount": 1127,
            "lineCount": 41,
            "hasHeadings": false,
            "hasLinks": false,
            "hasFrontmatter": false,
            "issues": [
              "No headings found"
            ],
            "acceptable": false
          }
        }
      },
      "error": null,
      "started_at": 1760221906953,
      "completed_at": 1760221907744,
      "duration": 791
    },
    {
      "id": "T1-001",
      "type": "blog",
      "source": {
        "id": "T1-001",
        "title": "How to Be Successful",
        "type": "blog",
        "url": "https://blog.samaltman.com/how-to-be-successful",
        "tier": 1,
        "priority": "CRITICAL",
        "estimated_pages": 3,
        "temporal_period": "YC President (2019)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760221906940,
      "updated_at": 1760221908525,
      "result": {
        "source_id": "T1-001",
        "platform": "medium",
        "markdown": "---\ntitle: \"How To Be Successful\"\nurl: https://blog.samaltman.com/how-to-be-successful\nplatform: medium\nsource_type: blog\nextracted: 2025-10-11T22:31:48.524Z\nextraction_method: medium\n---\n\nI’ve observed thousands of founders and thought a lot about what it takes to make a huge amount of money or to create something important. Usually, people start off wanting the former and end up wanting the latter.\n\nHere are 13 thoughts about how to achieve such outlier success. Everything here is easier to do once you’ve already reached a baseline degree of success (through privilege or effort) and want to put in the work to turn that into outlier success. \\[1\\] But much of it applies to anyone.\n\n**1\\. Compound yourself**\n\nCompounding is magic. Look for it everywhere. Exponential curves are the key to wealth generation.\n\nA medium-sized business that grows 50% in value every year becomes huge in a very short amount of time. Few businesses in the world have true network effects and extreme scalability. But with technology, more and more will.  It’s worth a lot of effort to find them and create them.\n\nYou also want to be an exponential curve yourself—you should aim for your life to follow an ever-increasing up-and-to-the-right trajectory. It’s important to move towards a career that has a compounding effect—most careers progress fairly linearly.\n\nYou don't want to be in a career where people who have been doing it for two years can be as effective as people who have been doing it for twenty—your rate of learning should always be high. As your career progresses, each unit of work you do should generate more and more results. There are many ways to get this leverage, such as capital, technology, brand, network effects, and managing people.\n\nIt’s useful to focus on adding another zero to whatever you define as your success metric—money, status, impact on the world, or whatever. I am willing to take as much time as needed between projects to find my next thing. But I always want it to be a project that, if successful, will make the rest of my career look like a footnote.\n\nMost people get bogged down in linear opportunities. Be willing to let small opportunities go to focus on potential step changes.\n\nI think the biggest competitive advantage in business—either for a company or for an individual’s career—is long-term thinking with a broad view of how different systems in the world are going to come together. One of the notable aspects of compound growth is that the furthest out years are the most important. In a world where almost no one takes a truly long-term view, the market richly rewards those who do.\n\nTrust the exponential, be patient, and be pleasantly surprised.\n\n**2\\. Have almost too much self-belief**\n\nSelf-belief is immensely powerful. The most successful people I know believe in themselves almost to the point of delusion.\n\nCultivate this early. As you get more data points that your judgment is good and you can consistently deliver results, trust yourself more.\n\nIf you don’t believe in yourself, it’s hard to let yourself have contrarian ideas about the future. But this is where most value gets created.\n\nI remember when Elon Musk took me on a tour of the SpaceX factory many years ago. He talked in detail about manufacturing every part of the rocket, but the thing that sticks in memory was the look of absolute certainty on his face when he talked about sending large rockets to Mars. I left thinking “huh, so that’s the benchmark for what conviction looks like.”\n\nManaging your own morale—and your team’s morale—is one of the greatest challenges of most endeavors. It’s almost impossible without a lot of self-belief. And unfortunately, the more ambitious you are, the more the world will try to tear you down.\n\nMost highly successful people have been really right about the future at least once at a time when people thought they were wrong. If not, they would have faced much more competition.\n\nSelf-belief must be balanced with self-awareness. I used to hate criticism of any sort and actively avoided it. Now I try to always listen to it with the assumption that it’s true, and then decide if I want to act on it or not. Truth-seeking is hard and often painful, but it is what separates self-belief from self-delusion.\n\nThis balance also helps you avoid coming across as entitled and out of touch.\n\n**3\\. Learn to think independently**\n\nEntrepreneurship is very difficult to teach because original thinking is very difficult to teach. School is not set up to teach this—in fact, it generally rewards the opposite. So you have to cultivate it on your own.\n\nThinking from first principles and trying to generate new ideas is fun, and finding people to exchange them with is a great way to get better at this. The next step is to find easy, fast ways to test these ideas in the real world.\n\n“I will fail many times, and I will be really right once” is the entrepreneurs’ way. You have to give yourself a lot of chances to get lucky.\n\nOne of the most powerful lessons to learn is that you can figure out what to do in situations that seem to have no solution. The more times you do this, the more you will believe it. Grit comes from learning you can get back up after you get knocked down.\n\n**4\\. Get good at “sales”**\n\nSelf-belief alone is not sufficient—you also have to be able to convince other people of what you believe.\n\nAll great careers, to some degree, become sales jobs. You have to evangelize your plans to customers, prospective employees, the press, investors, etc. This requires an inspiring vision, strong communication skills, some degree of charisma, and evidence of execution ability.\n\nGetting good at communication—particularly written communication—is an investment worth making. My best advice for communicating clearly is to first make sure your thinking is clear and then use plain, concise language.\n\nThe best way to be good at sales is to genuinely believe in what you’re selling. Selling what you truly believe in feels great, and trying to sell snake oil feels awful.\n\nGetting good at sales is like improving at any other skill—anyone can get better at it with deliberate practice. But for some reason, perhaps because it feels distasteful, many people treat it as something unlearnable.\n\nMy other big sales tip is to show up in person whenever it’s important. When I was first starting out, I was always willing to get on a plane. It was frequently unnecessary, but three times it led to career-making turning points for me that otherwise would have gone the other way.\n\n**5\\. Make it easy to take risks**\n\nMost people overestimate risk and underestimate reward. Taking risks is important because it’s impossible to be right all the time—you have to try many things and adapt quickly as you learn more.\n\nIt’s often easier to take risks early in your career; you don’t have much to lose, and you potentially have a lot to gain. Once you’ve gotten yourself to a point where you have your basic obligations covered you should try to make it easy to take risks. Look for small bets you can make where you lose 1x if you’re wrong but make 100x if it works. Then make a bigger bet in that direction.\n\nDon’t save up for too long, though. At YC, we’ve often noticed a problem with founders that have spent a lot of time working at Google or Facebook. When people get used to a comfortable life, a predictable job, and a reputation of succeeding at whatever they do, it gets very hard to leave that behind (and people have an incredible ability to always match their lifestyle to next year’s salary). Even if they do leave, the temptation to return is great. It’s easy—and human nature—to prioritize short-term gain and convenience over long-term fulfillment.\n\nBut when you aren’t on the treadmill, you can follow your hunches and spend time on things that might turn out to be really interesting. Keeping your life cheap and flexible for as long as you can is a powerful way to do this, but obviously comes with tradeoffs.\n\n**6\\. Focus**\n\nFocus is a force multiplier on work.\n\nAlmost everyone I’ve ever met would be well-served by spending more time thinking about what to focus on. It is much more important to work on the right thing than it is to work many hours. Most people waste most of their time on stuff that doesn’t matter.\n\nOnce you have figured out what to do, be unstoppable about getting your small handful of priorities accomplished quickly. I have yet to meet a slow-moving person who is very successful.\n\n**7\\. Work hard**\n\nYou can get to about the 90th percentile in your field by working either smart or hard, which is still a great accomplishment. But getting to the 99th percentile requires both—you will be competing with other very talented people who will have great ideas and be willing to work a lot.\n\nExtreme people get extreme results. Working a lot comes with huge life trade-offs, and it’s perfectly rational to decide not to do it. But it has a lot of advantages. As in most cases, momentum compounds, and success begets success.\n\nAnd it’s often really fun. One of the great joys in life is finding your purpose, excelling at it, and discovering that your impact matters to something larger than yourself. A YC founder recently expressed great surprise about how much happier and more fulfilled he was after leaving his job at a big company and working towards his maximum possible impact. Working hard at that should be celebrated.\n\nIt’s not entirely clear to me why working hard has become a Bad Thing in certain parts of the US, but this is certainly not the case in other parts of the world—the amount of energy and drive exhibited by entrepreneurs outside of the US is quickly becoming the new benchmark.\n\nYou have to figure out how to work hard without burning out. People find their own strategies for this, but one that almost always works is to find work you like doing with people you enjoy spending a lot of time with.\n\nI think people who pretend you can be super successful professionally without working most of the time (for some period of your life) are doing a disservice. In fact, work stamina seems to be one of the biggest predictors of long-term success.\n\nOne more thought about working hard: do it at the beginning of your career. Hard work compounds like interest, and the earlier you do it, the more time you have for the benefits to pay off. It’s also easier to work hard when you have fewer other responsibilities, which is frequently but not always the case when you’re young.\n\n**8\\. Be bold**\n\nI believe that it’s easier to do a hard startup than an easy startup. People want to be part of something exciting and feel that their work matters.\n\nIf you are making progress on an important problem, you will have a constant tailwind of people wanting to help you. Let yourself grow more ambitious, and don’t be afraid to work on what you really want to work on.\n\nIf everyone else is starting meme companies, and you want to start a gene-editing company, then do that and don’t second guess it.\n\nFollow your curiosity. Things that seem exciting to you will often seem exciting to other people too.\n\n**9\\. Be willful**\n\nA big secret is that you can bend the world to your will a surprising percentage of the time—most people don’t even try, and just accept that things are the way that they are.\n\nPeople have an enormous capacity to make things happen. A combination of self-doubt, giving up too early, and not pushing hard enough prevents most people from ever reaching anywhere near their potential.\n\nAsk for what you want. You usually won’t get it, and often the rejection will be painful. But when this works, it works surprisingly well.\n\nAlmost always, the people who say “I am going to keep going until this works, and no matter what the challenges are I’m going to figure them out”, and mean it, go on to succeed. They are persistent long enough to give themselves a chance for luck to go their way.\n\nAirbnb is my benchmark for this. There are so many stories they tell that I wouldn’t recommend trying to reproduce (keeping maxed-out credit cards in those nine-slot three-ring binder pages kids use for baseball cards, eating dollar store cereal for every meal, battle after battle with powerful entrenched interest, and on and on) but they managed to survive long enough for luck to go their way.\n\nTo be willful, you have to be optimistic—hopefully this is a personality trait that can be improved with practice. I have never met a very successful pessimistic person.\n\n**10\\. Be hard to compete with**\n\nMost people understand that companies are more valuable if they are difficult to compete with. This is important, and obviously true.\n\nBut this holds true for you as an individual as well. If what you do can be done by someone else, it eventually will be, and for less money.\n\nThe best way to become difficult to compete with is to build up leverage. For example, you can do it with personal relationships, by building a strong personal brand, or by getting good at the intersection of multiple different fields. There are many other strategies, but you have to figure out some way to do it.\n\nMost people do whatever most people they hang out with do. This mimetic behavior is usually a mistake—if you’re doing the same thing everyone else is doing, you will not be hard to compete with.\n\n**11\\. Build a network**\n\nGreat work requires teams. Developing a network of talented people to work with—sometimes closely, sometimes loosely—is an essential part of a great career. The size of the network of really talented people you know often becomes the limiter for what you can accomplish.\n\nAn effective way to build a network is to help people as much as you can. Doing this, over a long period of time, is what lead to most of my best career opportunities and three of my four best investments. I’m continually surprised how often something good happens to me because of something I did to help a founder ten years ago.\n\nOne of the best ways to build a network is to develop a reputation for really taking care of the people who work with you. Be overly generous with sharing the upside; it will come back to you 10x. Also, learn how to evaluate what people are great at, and put them in those roles. (This is the most important thing I have learned about management, and I haven’t read much about it.) You want to have a reputation for pushing people hard enough that they accomplish more than they thought they could, but not so hard they burn out.\n\nEveryone is better at some things than others. Define yourself by your strengths, not your weaknesses. Acknowledge your weaknesses and figure out how to work around them, but don’t let them stop you from doing what you want to do. “I can’t do X because I’m not good at Y” is something I hear from entrepreneurs surprisingly often, and almost always reflects a lack of creativity. The best way to make up for your weaknesses is to hire complementary team members instead of just hiring people who are good at the same things you are.\n\nA particularly valuable part of building a network is to get good at discovering undiscovered talent. Quickly spotting intelligence, drive, and creativity gets much easier with practice. The easiest way to learn is just to meet a lot of people, and keep track of who goes on to impress you and who doesn’t. Remember that you are mostly looking for rate of improvement, and don’t overvalue experience or current accomplishment.\n\nI try to always ask myself when I meet someone new “is this person a force of nature?” It’s a pretty good heuristic for finding people who are likely to accomplish great things.\n\nA special case of developing a network is finding someone eminent to take a bet on you, ideally early in your career. The best way to do this, no surprise, is to go out of your way to be helpful. (And remember that you have to pay this forward at some point later!)\n\nFinally, remember to spend your time with positive people who support your ambitions.\n\n**12\\. You get rich by owning things**\n\nThe biggest economic misunderstanding of my childhood was that people got rich from high salaries. Though there are some exceptions—entertainers for example —almost no one in the history of the Forbes list has gotten there with a salary.\n\nYou get truly rich by owning things that increase rapidly in value.\n\nThis can be a piece of a business, real estate, natural resource, intellectual property, or other similar things. But somehow or other, you need to own equity in something, instead of just selling your time. Time only scales linearly.\n\nThe best way to make things that increase rapidly in value is by making things people want at scale.\n\n**13\\. Be internally driven**\n\nMost people are primarily externally driven; they do what they do because they want to impress other people. This is bad for many reasons, but here are two important ones.\n\nFirst, you will work on consensus ideas and on consensus career tracks.  You will care a lot—much more than you realize—if other people think you’re doing the right thing. This will probably prevent you from doing truly interesting work, and even if you do, someone else would have done it anyway.\n\nSecond, you will usually get risk calculations wrong. You’ll be very focused on keeping up with other people and not falling behind in competitive games, even in the short term.\n\nSmart people seem to be especially at risk of such externally-driven behavior. Being aware of it helps, but only a little—you will likely have to work super-hard to not fall in the mimetic trap.\n\nThe most successful people I know are primarily internally driven; they do what they do to impress themselves and because they feel compelled to make something happen in the world. After you’ve made enough money to buy whatever you want and gotten enough social status that it stops being fun to get more, this is the only force I know of that will continue to drive you to higher levels of performance.\n\nThis is why the question of a person’s motivation is so important. It’s the first thing I try to understand about someone. The right motivations are hard to define a set of rules for, but you know it when you see it.\n\nJessica Livingston and Paul Graham are my benchmarks for this. YC was widely mocked for the first few years, and almost no one thought it would be a big success when they first started. But they thought it would be great for the world if it worked, and they love helping people, and they were convinced their new model was better than the existing model.\n\nEventually, you will define your success by performing excellent work in areas that are important to you. The sooner you can start off in that direction, the further you will be able to go. It is hard to be wildly successful at anything you aren’t obsessed with.\n\n\n\\[1\\] A comment response I wrote on HN:\n\nOne of the biggest reasons I'm excited about basic income is the amount of human potential it will unleash by freeing more people to take risks.\n\nUntil then, if you aren't born lucky, you have to claw your way up for awhile before you can take big swings. If you are born in extreme poverty, then this is super difficult :(\n\nIt is obviously an incredible shame and waste that opportunity is so unevenly distributed. But I've witnessed enough people be born with the deck stacked badly against them and go on to incredible success to know it's possible.\n\nI am deeply aware of the fact that I personally would not be where I am if I weren't born incredibly lucky.\n\n\n\n\nThanks to Brian Armstrong, Greg Brockman, Dalton Caldwell, Diane von Furstenberg, Maddie Hall, Drew Houston, Vinod Khosla, Jessica Livingston, Jon Levy, Luke Miles (6 drafts!), Michael Moritz, Ali Rowghani, Michael Seibel, Peter Thiel, Tracy Young and Shivon Zilis for reviewing drafts of this, and thanks especially to Lachy Groom for help writing it.",
        "metadata": {
          "url": "https://blog.samaltman.com/how-to-be-successful",
          "platform": "medium",
          "title": "How To Be Successful",
          "author": null,
          "date": null,
          "excerpt": "I’ve observed thousands of founders and thought a lot about what it takes to make a huge amount of money or to create something important. Usually, people start off wanting the former and end up...",
          "categories": [],
          "tags": [],
          "member_only": false,
          "topics": []
        },
        "output_path": "/Users/oalanicolas/Documents/Code/mente_lendaria/docs/minds/sam_altman/sources/downloads/blogs/T1-001.md",
        "validation": {
          "score": 70,
          "acceptable": true,
          "issues": [
            "Missing author and date",
            "Low markdown quality: 40"
          ],
          "markdownQuality": {
            "score": 40,
            "wordCount": 3436,
            "lineCount": 193,
            "hasHeadings": false,
            "hasLinks": false,
            "hasFrontmatter": false,
            "issues": [
              "No headings found",
              "Excessive whitespace found"
            ],
            "acceptable": false
          }
        }
      },
      "error": null,
      "started_at": 1760221906940,
      "completed_at": 1760221908525,
      "duration": 1585
    },
    {
      "id": "T1-007",
      "type": "blog",
      "source": {
        "id": "T1-007",
        "title": "Startup Playbook",
        "type": "blog",
        "url": "https://playbook.samaltman.com/",
        "tier": 1,
        "priority": "CRITICAL",
        "estimated_pages": 10,
        "temporal_period": "YC President (2014-2019)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760221906954,
      "updated_at": 1760221908750,
      "result": {
        "source_id": "T1-007",
        "platform": "generic",
        "markdown": "---\ntitle: \"Startup Playbook\"\nurl: https://playbook.samaltman.com/\nplatform: generic\nsource_type: blog\nextracted: 2025-10-11T22:31:48.748Z\nextraction_method: generic\n---\n\nStartup Playbook\n\n## Written by Sam Altman · Illustrated by Gregory Koberger · [Spanish translation](https://platzi.com/startup-playbook/)\n\nWe spend a lot of time advising startups. Though one-on-one advice will always be crucial, we thought it might help us scale Y Combinator if we could distill the most generalizable parts of this advice into a sort of playbook we could give YC and YC Fellowship companies.\n\nThen we thought we should just give it to everyone.\n\nThis is meant for people new to the world of startups. Most of this will not be new to people who have read a lot of what YC partners have written—the goal is to get it into one place.\n\nThere may be a part II on how to scale a startup later—this mostly covers how to start one.\n\n- Part I: The Idea\n- Part II: A Great Team\n- Part III: A Great Product\n- Part IV: Great Execution\n- Closing Thought\n\n- Growth\n- Focus & Intensity\n- Jobs of the CEO\n- Hiring & Managing\n- Competitors\n- Making Money\n- Fundraising\n\nYour goal as a startup is to make something users love. If you do that, then you have to figure out how to get a lot more users. But this first part is critical—think about the really successful companies of today. They all started with a product that their early users loved so much they told other people about it. If you fail to do this, you will fail. If you deceive yourself and think your users love your product when they don’t, you will still fail.\n\nThe startup graveyard is littered with people who thought they could skip this step.\n\nIt’s much better to first make a product a small number of users love than a product that a large number of users like. Even though the total amount of positive feeling is the same, it’s much easier to get more users than to go from like to love.\n\nA word of warning about choosing to start a startup: It sucks! One of the most consistent pieces of feedback we get from YC founders is it’s harder than they could have ever imagined, because they didn’t have a framework for the sort of work and intensity a startup entails. Joining an early-stage startup that’s on a rocketship trajectory is usually a much better financial deal.\n\nOn the other hand, starting a startup is not in fact very risky to your career—if you’re really good at technology, there will be job opportunities if you fail. Most people are very bad at evaluating risk. I personally think the riskier option is having an idea or project you’re really passionate about and working at a safe, easy, unfulfilling job instead.\n\nTo have a successful startup, you need: a great idea (including a great market), a great team, a great product, and great execution.\n\n### Part I**The Idea**\n\nOne of the first things we ask YC companies is what they’re building and why.\n\nWe look for clear, concise answers here. This is both to evaluate you as a founder and the idea itself. It’s important to be able to think and communicate clearly as a founder—you’ll need it for recruiting, raising money, selling, etc. Ideas in general need to be clear to spread, and complex ideas are almost always a sign of muddled thinking or a made up problem. If the idea does not really excite at least some people the first time they hear it, that’s bad.\n\nAnother thing we ask is who desperately needs the product.\n\nIn the best case, you yourself are the target user. In the second best case, you understand the target user extremely well.\n\nIf a company already has users, we ask how many and how fast that number is growing. We try to figure out why it’s not growing faster, and we especially try to figure out if users really love the product. Usually this means they’re telling their friends to use the product without prompting from the company. We also ask if the company is generating revenue, and if not, why not.\n\nIf the company doesn’t yet have users, we try to figure out the minimum thing to build first to test the hypothesis—i.e., if we work backwards from the perfect experience, we try to figure out what kernel to start with.\n\nThe way to test an idea is to either launch it and see what happens or try to sell it (e.g. try to get a letter of intent before you write a line of code.) The former works better for consumer ideas (users may tell you they will use it, but in practice it won’t cut through the clutter) and the latter works better for enterprise ideas (if a company tells you they will buy something, then go build it.) Specifically, if you are an enterprise company, one of the first questions we’ll ask you is if you have a letter of intent from a customer saying they’ll buy what you’re building. For most biotech and hard tech companies, the way to test an idea is to first talk to potential customers and then figure out the smallest subset of the technology you can build first.\n\nIt’s important to let your idea evolve as you get feedback from users. And it’s critical you understand your users really well—you need this to evaluate an idea, build a great product, and build a great company.\n\nAs mentioned earlier, startups are really hard. They take a very long time, and consistent intense effort. The founders and employees need to have a shared sense of mission to sustain them. So we ask why founders want to start this particular company.\n\nWe also ask how the company will one day be a monopoly. There are a lot of different terms for this, but we use Peter Thiel’s. Obviously, we don’t want your company to behave in an unethical way against competitors. Instead, we’re looking for businesses that get more powerful with scale and that are difficult to copy.\n\nFinally, we ask about the market. We ask how big it is today, how fast it’s growing, and why it’s going to be big in ten years. We try to understand why the market is going to grow quickly, and why it’s a good market for a startup to go after. We like it when major technological shifts are just starting that most people haven’t realized yet—big companies are bad at addressing those. And somewhat counterintuitively, the best answer is going after a large part of a small market.\n\nA few other thoughts on ideas:\n\nWe greatly prefer something new to something derivative. Most really big companies start with something fundamentally new (one acceptable definition of new is 10x better.) If there are ten other companies starting at the same time with the same plan, and it sounds a whole lot like something that already exists, we are skeptical.\n\nOne important counterintuitive reason for this is that it’s easier to do something new and hard than something derivative and easy. People will want to help you and join you if it’s the former; they will not if it’s the latter.\n\nThe best ideas sound bad but are in fact good. So you don’t need to be too secretive with your idea—if it’s actually a good idea, it likely won’t sound like it’s worth stealing. Even if it does sound like it’s worth stealing, there are at least a thousand times more people that have good ideas than people who are willing to do the kind of work it takes to turn a great idea into a great company. And if you tell people what you’re doing, they might help.\n\nSpeaking of telling people your idea—while it’s important the idea really excites some people the first time they hear it, almost everyone is going to tell you that your idea sucks. Maybe they are right. Maybe they are not good at evaluating startups, or maybe they are just jealous. Whatever the reason is, it will happen a lot, it will hurt, and even if you think you’re not going to be affected by it, you still will be. The faster you can develop self-belief and not get dragged down too much by haters, the better off you’ll be. No matter how successful you are, the haters will never go away.\n\nWhat if you don’t have an idea but want to start a startup? Maybe you shouldn’t. It’s so much better if the idea comes first and the startup is the way to get the idea out into the world.\n\nWe once tried an experiment where we funded a bunch of promising founding teams with no ideas in the hopes they would land on a promising idea after we funded them.\n\nAll of them failed. I think part of the problem is that good founders tend to have lots of good ideas (too many, usually). But an even bigger problem is that once you have a startup you have to hurry to come up with an idea, and because it’s already an official company the idea can’t be too crazy. You end up with plausible sounding but derivative ideas. This is the danger of pivots.\n\nSo it’s better not to try too actively to force yourself to come up with startup ideas. Instead, learn about a lot of different things. Practice noticing problems, things that seem inefficient, and major technological shifts. [Work on projects you find interesting](http://blog.samaltman.com/projects-and-companies). Go out of your way to hang around smart, interesting people. At some point, ideas will emerge.\n\n### Part II**A Great Team**\n\nMediocre teams do not build great companies. One of the things we look at the most is the strength of the founders. When I used to do later-stage investing, I looked equally hard at the strength of the employees the founders hired.\n\nWhat makes a great founder? The most important characteristics are ones like unstoppability, determination, formidability, and resourcefulness. Intelligence and passion also rank very highly. These are all much more important than experience and certainly “expertise with language X and framework Y”.\n\nWe have noticed the most successful founders are the sort of people who are low-stress to work with because you feel “he or she will get it done, no matter what it is.” Sometimes you can succeed through sheer force of will.\n\nGood founders have a number of seemingly contradictory traits. One important example is rigidity and flexibility. You want to have strong beliefs about the core of the company and its mission, but still be very flexible and willing to learn new things when it comes to almost everything else.\n\nThe best founders are unusually responsive. This is an indicator of decisiveness, focus, intensity, and the ability to get things done.\n\nFounders that are hard to talk to are almost always bad. Communication is a very important skill for founders—in fact, I think this is the most important rarely-discussed founder skill.\n\nTech startups need at least one founder who can build the company’s product or service, and at least one founder who is (or can become) good at sales and talking to users. This can be the same person.\n\nConsider these criteria when you’re choosing a cofounder -- it’s one of the most important decisions you’ll make, and it’s often done fairly randomly. You want someone you know well, not someone you just met at a cofounder dating thing. You can evaluate anyone you might work with better with more data, and you really don’t want to get this one wrong. Also, at some point, the expected value of the startup is likely to dip below the X axis. If you have a pre-existing relationship with your cofounders, none of you will want to let the other down and you’ll keep going. Cofounder breakups are one of the leading causes of death for early startups, and we see them happen very, very frequently in cases where the founders met for the express purpose of starting the company.\n\nThe best case, by far, is to have a good cofounder. The next best is to be a solo founder. The worse case, by far, is to have a bad cofounder. If things are not working out, you should part ways quickly.\n\nA quick note on equity: the conversation about the equity split does not get easier with time—it’s better to set it early on. Nearly equal is best, though perhaps in the case of two founders it’s best to have one person with one extra share to prevent deadlocks when the cofounders have a fallout.\n\n### Part III**A Great Product**\n\nHere is the secret to success: have a great product. This is the only thing all great companies have in common.\n\nIf you do not build a product users love you will eventually fail. Yet founders always look for some other trick. Startups are the point in your life when tricks stop working.\n\nA great product is the only way to grow long-term. Eventually your company will get so big that all growth hacks stop working and you have to grow by people wanting to use your product. This is the most important thing to understand about super-successful companies. There is no other way. Think about all of the really successful technology companies—they all do this.\n\nYou want to build a “product improvement engine” in your company. You should talk to your users and watch them use your product, figure out what parts are sub-par, and then make your product better. Then do it again. This cycle should be the number one focus of the company, and it should drive everything else. If you improve your product 5% every week, it will really compound.\n\nThe faster the repeat rate of this cycle, the better the company usually turns out. During YC, we tell founders they should be building product and talking to users, and not much else besides eating, sleeping, exercising, and spending time with their loved ones.\n\nTo do this cycle right, you have to get very close to your users. Literally watch them use your product. Sit in their office if you can. Value both what they tell you and what they actually do. You should not put anyone between the founders and the users for as long as possible—that means the founders need to do sales, customer support, etc.\n\nUnderstand your users as well as you possibly can. Really figure out what they need, where to find them, and what makes them tick.\n\n“Do things that don’t scale” has rightfully become a mantra for startups. You usually need to recruit initial users one at a time (Ben Silbermann used to approach strangers in coffee shops in Palo Alto and ask them to try Pinterest) and then build things they ask for. Many founders hate this part, and just want to announce their product in the press. But that almost never works. Recruit users manually, and make the product so good the users you recruit tell their friends.\n\nYou also need to break things into very small pieces, and iterate and adapt as you go. Don’t try to plan too far out, and definitely don’t batch everything into one big public release. You want to start with something very simple—as little surface area as possible—and launch it sooner than you’d think. In fact, simplicity is always good, and you should always keep your product and company as simple as possible.\n\nSome common questions we ask startups having problems: Are users using your product more than once? Are your users fanatical about your product? Would your users be truly bummed if your company went away? Are your users recommending you to other people without you asking them to do it? If you’re a B2B company, do you have at least 10 paying customers?\n\nIf not, then that’s often the underlying problem, and we tell companies to make their product better. I am skeptical about most excuses for why a company isn’t growing—very often the real reason is that the product just isn’t good enough.\n\nWhen startups aren’t sure what to do next with their product, or if their product isn’t good enough, we send them to go talk to their users. This doesn’t work in every case—it’s definitely true that people would have asked Ford for faster horses—but it works surprisingly often. In fact, more generally, when there’s a disagreement about anything in the company, talk to your users.\n\nThe best founders seem to care a little bit too much about product quality, even for seemingly unimportant details. But it seems to work. By the way, “product” includes all interactions a user has with the company. You need to offer great support, great sales interactions, etc.\n\nRemember, if you haven’t made a great product, nothing else will save you.\n\n### Part IV**Great Execution**\n\nAlthough it’s necessary to build a great product, you’re not done after that. You still have to turn it into a great company, and you have to do it yourself—the fantasy of hiring an “experienced manager” to do all this work is both extremely prevalent and a graveyard for failed companies. You cannot outsource the work to someone else for a long time.\n\nThis sounds obvious, but you have to make money. This would be a good time to start thinking about how that’s going to work.\n\nThe only universal job description of a CEO is to make sure the company wins. You can do this as the founder even if you have a lot of flaws that would normally disqualify you as a CEO as long as you hire people that complement your own skills and let them do their jobs. That experienced CEO with a fancy MBA may not have the skill gaps you have, but he or she won’t understand the users as well, won’t have the same product instincts, and won’t care as much.\n\n### Part IV: Execution**Growth**\n\nGrowth and momentum are the keys to great execution. Growth (as long as it is not “sell dollar bills for 90 cents” growth) solves all problems, and lack of growth is not solvable by anything but growth. If you’re growing, it feels like you’re winning, and people are happy. If you’re growing, there are new roles and responsibilities all the time, and people feel like their careers are advancing. If you’re not growing, it feels like you’re losing, and people are unhappy and leave. If you’re not growing, people just fight over responsibilities and blame.\n\nFounders and employees that are burn out nearly always work at startups without momentum. It’s hard to overstate how demoralizing it is.\n\nThe prime directive of great execution is “Never lose momentum”. But how do you do it?\n\nThe most important way is to make it your top priority. The company does what the CEO measures. It’s valuable to have a single metric that the company optimizes, and it’s worth time to figure out the right growth metric. If you care about growth, and you set the execution bar, the rest of the company will focus on it.\n\nHere are a couple of examples.\n\nThe founders of Airbnb drew a forward-looking graph of the growth they wanted to hit. They posted this everywhere—on their fridge, above their desks, on their bathroom mirror. If they hit the number that week, great. If not, it was all they talked about.\n\nMark Zuckerberg once said that one of the most important innovations at Facebook was their establishment of a growth group when growth slowed. This group was (and perhaps still is) one of the most prestigious groups in the company—everyone knew how important it was.\n\nKeep a list of what’s blocking growth. Talk as a company about how you could grow faster. If you know what the limiters are, you’ll naturally think about how to address them.\n\nFor anything you consider doing, ask yourself “Is this the best way to optimize growth?” For example, going to a conference is not usually the best way to optimize growth, unless you expect to sell a lot there.\n\nExtreme internal transparency around metrics (and financials) is a good thing to do. For some reason, founders are always really scared of this. But it’s great for keeping the whole company focused on growth. There seems to be a direct correlation between how focused on metrics employees at a company are and how well they’re doing. If you hide the metrics, it’s hard for people to focus on them.\n\nSpeaking of metrics, don’t fool yourself with vanity metrics. The common mistake here is to focus on signups and ignore retention. But retention is as important to growth as new user acquisition.\n\nIt’s also important to establish an internal cadence to keep momentum. You want to have a “drumbeat” of progress—new features, customers, hires, revenue milestones, partnerships, etc that you can talk about internally and externally.\n\nYou should set aggressive but borderline achievable goals and review progress every month. Celebrate wins! Talk internally about strategy all the time, tell everyone what you’re hearing from customers, etc. The more information you share internally—good and bad—the better you’ll be.\n\nThere are a few traps that founders often fall into. One is that if the company is growing like crazy but everything seems incredibly broken and inefficient, everyone worries that things are going to come unraveled. In practice, this seems to happen rarely (Friendster is the most recent example of a startup dying because of technical debt that I can point to.) Counterintuitively, it turns out that it’s good if you’re growing fast but nothing is optimized—all you need to do is fix it to get more growth! My favorite investments are in companies that are growing really fast but incredibly un-optimized—they are deeply undervalued.\n\nA related trap is thinking about problems too far in the future—i.e. “How are we going to do this at massive scale?” The answer is to figure it out when you get there. Far more startups die while debating this question than die because they didn’t think about it enough. A good rule of thumb is to only think about how things will work at 10x your current scale. Most early-stage startups should put “Do things that don’t scale” up on their wall and live by it. As an example, great startups always have great customer service in the early days, and bad startups worry about the impact on the unit economics and that it won’t scale. But great customer service makes for passionate early users, and as the product gets better you need less support, because you’ll know what customers commonly struggle with and improve the product/experience in those areas. (By the way, this is a really important example—have great customer support.)\n\nThere’s a big catch to this—”Do things that don’t scale” does not excuse you from having to eventually make money. It’s ok to have bad unit economics in the early days, but you have to have a good reason for why the unit economics are going to work out later.\n\nAnother trap is getting demoralized because growth is bad in absolute numbers even though it’s good on a percentage basis. Humans are very bad at intuition around exponential growth. Remind your team of this, and that all giant companies started growing from small numbers.\n\nSome of the biggest traps are the things that founders believe will deliver growth but in practice almost never work and suck up a huge amount of time. Common examples are deals with other companies and the “big press launch”. Beware of these and understand that they effectively never work. Instead get growth the same way all great companies have—by building a product users love, recruiting users manually first, and then testing lots of growth strategies (ads, referral programs, sales and marketing, etc.) and doing more of what works. Ask your customers where you can find more people like them.\n\nRemember that sales and marketing are not bad words. Though neither will save you if you don’t have a great product, they can both help accelerate growth substantially. If you’re an enterprise company, it’s likely a requirement that your company get good at these.\n\nDon’t be afraid of sales especially. At least one founder has to get good at asking people to use your product and give you money.\n\nAlex Schultz [gave a lecture on growth for consumer products](http://startupclass.samaltman.com/courses/lec06/) that’s well worth watching. For B2B products, I think the right answer is almost always to track revenue growth per month, and remember that the longer sales cycle means the first couple of months are going to look ugly (though sometimes selling to startups as initial customers can solve this problem).\n\n### Part IV: Execution**Focus & Intensity**\n\nIf I had to distill my advice about how to operate down to only two words, I’d pick focus and intensity. These words seem to really apply to the best founders I know.\n\nThey are relentlessly focused on their product and growth. They don’t try to do everything—in fact, they say no a lot (this is hard because the sort of people that start companies are the sort of people that like doing new things.)\n\nAs a general rule, don’t let your company start doing the next thing until you’ve dominated the first thing. No great company I know of started doing multiple things at once—they start with a lot of conviction about one thing, and see it all the way through. You can do far fewer things than you think. A very, very common cause of startup death is doing too many of the wrong things. Prioritization is critical and hard. (Equally important to setting the company’s priorities is setting your own tactical priorities. What I’ve found works best for me personally is a pen-and-paper list for each day with ~3 major tasks and ~30 minor ones, and an annual to-do list of overall goals.)\n\nWhile great founders don’t do many big projects, they do whatever they do very intensely. They get things done very quickly. They are decisive, which is hard when you’re running a startup—you will get a lot of conflicting advice, both because there are multiple ways to do things and because there’s a lot of bad advice out there. Great founders listen to all of the advice and then quickly make their own decisions.\n\nPlease note that this doesn’t mean doing everything intensely—that’s impossible. You have to pick the right things. As Paul Buchheit says, find ways to get 90% of the value with 10% of the effort. The market doesn’t care how hard you work—it only cares if you do the right things.\n\nIt’s very hard to be both obsessed with product quality and move very quickly. But it’s one of the most obvious tells of a great founder.\n\nI have never, not once, seen a slow-moving founder be really successful.\n\nYou are not different from other startups. You still have to stay focused and move fast. Companies building rockets and nuclear reactors still manage to do this. All failing companies have a pet explanation for why they are different and don’t have to move fast.\n\nWhen you find something that works, keep going. Don’t get distracted and do something else. Don’t take your foot off the gas.\n\nDon’t get caught up in early success—you didn’t get off to a promising start by going to lots of networking events and speaking on lots of panels. Startup founders who start to have initial success have a choice of two paths: either they keep doing what they’re doing, or they start spending a lot of time thinking about their “personal brand” and enjoying the status of being a founder.\n\nIt’s hard to turn down the conferences and the press profiles—they feel good, and it’s especially hard to watch other founders in your space get the attention. But this won’t last long. Eventually the press figures out who is actually winning, and if your company is a real success, you’ll have more attention than you’ll ever want. The extreme cases—early-stage founders with their own publicists—that one would think only exist in TV shows actually exist in real life, and they almost always fail.\n\nFocus and intensity will win out in the long run. (Charlie Rose once said that things get done in the world through a combination of focus and personal connections, and that’s always stuck with me.)\n\n### Part IV: Execution**Jobs *of the* CEO**\n\nEarlier I mentioned that the only universal job description of the CEO is to make sure the company wins. Although that’s true, I wanted to talk a little more specifically about how a CEO should spend his or her time.\n\nA CEO has to 1) set the vision and strategy for the company, 2) evangelize the company to everyone, 3) hire and manage the team, especially in areas where you yourself have gaps 4) raise money, and 5) set the execution quality bar.\n\nIn addition to these, find whatever parts of the business you love the most, and stay engaged there.\n\nAs I mentioned at the beginning, it’s an intense job. If you are successful, it will take over your life to a degree you cannot imagine—the company will be on your mind all the time. Extreme focus and extreme intensity means it’s not the best choice for work-life balance. You can have one other big thing—your family, doing lots of triathlons, whatever—but probably not much more than that. You have to always be on, and there are a lot of decisions only you can make, no matter how good you get at delegation.\n\nYou should aim to be super responsive to your team and the outside world, always be clear on the strategy and priorities, show up to everything important, and execute quickly (especially when it comes to making decisions others are blocked on.) You should also adopt a “do whatever it takes” attitude—there will be plenty of unpleasant schleps. If the team sees you doing these things, they will do them too.\n\nManaging your own psychology is both really hard and really important. It’s become cliché at this point, but it’s really true—the emotional highs and lows are very intense, and if you don’t figure out how to stay somewhat level through them, you’re going to struggle. Being a CEO is lonely. It’s important to have relationships with other CEOs you can call when everything is melting down (one of the important accidental discoveries of YC was a way for founders to have peers.)\n\nA successful startup takes a very long time—certainly much longer than most founders think at the outset. You cannot treat it as an all-nighter. You have to eat well, sleep well, and exercise. You have to spend time with your family and friends. You also need to work in an area you’re actually passionate about—nothing else will sustain you for ten years.\n\nEverything will feel broken all the time—the diversity and magnitude of the disasters will surprise you. Your job is to fix them with a smile on your face and reassure your team that it’ll all be ok. Usually things aren’t as bad as they seem, but sometimes they are in fact really bad. In any case, just keep going. Keep growing.\n\nThe CEO doesn’t get to make excuses. Lots of bad and unfair things are going to happen. But don’t let yourself say, and certainly not to the team, “if only we had more money” or “if only we had another engineer”. Either figure out a way to make that happen, or figure out what to do without it. People who let themselves make a lot of excuses usually fail in general, and startup CEOs who do it almost always fail. Let yourself feel upset at the injustice for 1 minute, and then realize that it’s up to you to figure out a solution. Strive for people to say “X just somehow always gets things done” when talking about you.\n\nNo first-time founder knows what he or she is doing. To the degree you understand that, and ask for help, you’ll be better off. It’s worth the time investment to learn to become a good leader and manager. The best way to do this is to find a mentor—reading books doesn’t seem to work as well.\n\nA surprising amount of our advice at YC is of the form “just ask them” or “just do it”. First-time founders think there must be some secret for when you need something from someone or you want to do some new thing. But again, startups are where tricks stop working. Just be direct, be willing to ask for what you want, and don’t be a jerk.\n\nIt’s important that you distort reality for others but not yourself. You have to convince other people that your company is primed to be the most important startup of the decade, but you yourself should be paranoid about everything that could go wrong.\n\nBe persistent. Most founders give up too quickly or move on to the next product too quickly. If things generally aren’t going well, figure out what the root cause of the problem is and make sure you address that. A huge part of being a successful startup CEO is not giving up (although you don’t want to be obstinate beyond all reason either—this is another apparent contradiction, and a hard judgment call to make.)\n\nBe optimistic. Although it’s possible that there is a great pessimistic CEO somewhere out in the world, I haven’t met him or her yet. A belief that the future will be better, and that the company will play an important role in making the future better, is important for the CEO to have and to infect the rest of the company with. This is easy in theory and hard in the practical reality of short-term challenges. Don’t lose sight of the long-term vision, and trust that the day-to-day challenges will someday be forgotten and replaced by memories of the year-to-year progress.\n\nAmong your most important jobs are defining the mission and defining the values. This can feel a little hokey, but it’s worth doing early on. Whatever you set at the beginning will usually still be in force years later, and as you grow, each new person needs to first buy in and then sell others on the mission and values of the company. So write your cultural values and mission down early.\n\nAnother cliché that I think is worth repeating: Building a company is somewhat like building a religion. If people don’t connect what they’re doing day-to-day with a higher purpose they care about, they will not do a great job. I think Airbnb has done the best job at this in the YC network, and I highly recommend taking a look at their cultural values.\n\nOne mistake that CEOs often make is to innovate in well-trodden areas of business instead of innovating in new products and solutions. For example, many founders think that they should spend their time discovering new ways to do HR, marketing, sales, financing, PR, etc. This is nearly always bad. Do what works in the well-established areas, and focus your creative energies on the product or service you’re building.\n\n### Part IV: Execution**Hiring & Managing**\n\nHiring is one of your most important jobs and the key to building a great company (as opposed to a great product.)\n\nMy first piece of advice about hiring is don’t do it. The most successful companies we’ve worked with at YC have waited a relatively long time to start hiring employees. Employees are expensive. Employees add organizational complexity and communication overhead. There are things you can say to your cofounders that you cannot say with employees in the room. Employees also add inertia—it gets exponentially harder to change direction with more people on the team. Resist the urge to derive your self-worth from your number of employees.\n\nThe best people have a lot of opportunities. They want to join rocketships. If you have nothing, it’s hard to hire them. Once you’re obviously winning, they’ll want to come join you.\n\nIt’s worth repeating that great people have a lot of options, and you need great people to build a great company. Be generous with equity, trust, and responsibility. Be willing to go after people you don’t think you’ll be able to get. Remember that the kind of people you want to hire can start their own companies if they want.\n\nWhen you are in recruiting mode (i.e., from when you get product-market fit to T-infinity), you should spend about 25% of your time on it. At least one founder, usually the CEO, needs to get great at recruiting. It’s most CEOs’ number one activity by time. Everyone says that CEOs should spend a lot of their time recruiting, but in practice, none but the best do. There’s probably something to that.\n\nDon’t compromise on the quality of people you hire. Everyone knows this, and yet everyone compromises on this at some point during a desperate need. Everyone goes on to regret it, and it sometimes almost kills the company. Good and bad people are both infectious, and if you start with mediocre people, the average does not usually trend up. Companies that start off with mediocre early employees almost never recover. Trust your gut on people. If you have doubt, then the answer is no.\n\nDo not hire chronically negative people. They do not fit what an early-stage startup needs—the rest of the world will be predicting your demise every day, and the company needs to be united internally in its belief to the contrary.\n\nValue aptitute over experience for almost all roles. Look for raw intelligence and a track record of getting things done. Look for people you like – you'll be spending a lot of time together and often in tense situations. For people you don't already know, try to work on a project together before they join full-time.\n\nInvest in becoming a good manager. This is hard for most founders, and it’s definitely counterintuitive. But it’s important to get good at this. Find mentors that can help you here. If you do not get good at this, you will lose employees quickly, and if you don’t retain employees, you can be the best recruiter in the world and it still won’t matter. Most of the principles on being a good manager are well-covered, but the one that I never see discussed is “don’t go into hero mode”. Most first-time managers fall victim to this at some point and try to do everything themselves, and become unavailable to their staff. It usually ends in a meltdown. Resist all temptation to switch into this mode, and be willing to be late on projects to have a well-functioning team.\n\nSpeaking of managing, try hard to have everyone in the same office. For some reason, startups always compromise on this. But nearly all of the most successful startups started off all together. I think remote work can work well for larger companies but it has not been a recipe for massive success for startups.\n\nFinally, fire quickly. Everyone knows this in principle and no one does it. But I feel I should say it anyway. Also, fire people who are toxic to the culture no matter how good they are at what they do. Culture is defined by who you hire, fire, and promote.\n\n[I wrote a blog post with more detail.](http://blog.samaltman.com/how-to-hire)\n\n### Part IV: Execution**Competitors**\n\nA quick word about competitors: competitors are a startup ghost story. First-time founders think they are what kill 99% of startups. But 99% of startups die from suicide, not murder. Worry instead about all of your internal problems. If you fail, it will very likely be because you failed to make a great product and/or failed to make a great company.\n\n99% of the time, you should ignore competitors. Especially ignore them when they raise a lot of money or make a lot of noise in the press. Do not worry about a competitor until they are beating you with a real, shipped product. Press releases are easier to write than code, which is easier still than making a great product. In the words of Henry Ford: \"The competitor to be feared is one who never bothers about you at all, but goes on making his own business better all the time.\"\n\nEvery giant company has faced worse competitive threats than what you are facing now when they were small, and they all came out ok. There is always a counter-move.\n\n### Part IV: Execution**Making Money**\n\nOh yes, making money. You need to figure out how to do that.\n\nThe short version of this is that you have to get people to pay you more money than it costs you to deliver your good/service. For some reason, people always forget to take into account the part about how much it costs to deliver it.\n\nIf you have a free product, don’t plan to grow by buying users. That’s really hard for ad-supported businesses. You need to make something people share with their friends.\n\nIf you have a paid product with less than a $500 customer lifetime value (LTV), you generally cannot afford sales. Experiment with different user acquisition methods like SEO/SEM, ads, mailings, etc., but try to repay your customer acquisition cost (CAC) in 3 months.\n\nIf you have a paid product with more than a $500 LTV (net to you) you generally can afford direct sales. Try selling the product yourself first to learn what works. Hacking Sales is a useful book to read.\n\nIn any case, try to get to “ramen profitability”—i.e., make enough money so that the founders can live on ramen—as quickly as you can. When you get here, you control your own destiny and are no longer at the whims of investors and financial markets.\n\nWatch your cash flow obsessively. Although it sounds unbelievable, we’ve seen founders run out of money without being aware it was happening a number of times (and [read Paul Graham’s essay](http://paulgraham.com/aord.html)).\n\n### Part IV: Execution**Fundraising**\n\nMost startups raise money at some point.\n\nYou should raise money when you need it or when it’s available on good terms. Be careful not to lose your sense of frugality or to start solving problems by throwing money at them. Not having enough money can be bad, but having too much money is almost always bad.\n\nThe secret to successfully raising money is to have a good company. All of the other stuff founders do to try to over-optimize the process probably only matters about 5% of the time. Investors are looking for companies that are going to be really successful whether or not they invest, but that can grow faster with outside capital. The “really successful” part is important—because investors’ returns are dominated by the big successes, if an investor believes you have a 100% chance of creating a $10 million company but almost no chance of building a larger company, he/she will still probably not invest even at a very low valuation. Always explain why you could be a huge success.\n\nInvestors are driven by the dual fears of missing the next Google, and fear of losing money on something that in retrospect looks obviously stupid. (For the best companies, they fear both at the same time.)\n\nIt is a bad idea to try to raise money when your company isn’t in good enough shape to attract capital. You will burn reputation and waste time.\n\nDon’t get demoralized if you struggle to raise money. Many of the best companies have struggled with this, because the best companies so often look bad at the beginning (and they nearly always look unfashionable.) When investors tell you no, believe the no but not the reason. And remember that anything but “yes” is a “no”—investors have a wonderful ability to say “no” in a way that sounds like “maybe yes”.\n\nIt’s really important to have fundraising conversations in parallel—don’t go down a list of your favorite investors sequentially. The way to get investors to act is fear of other investors taking away their opportunity.\n\nView fundraising as a necessary evil and something to get done as quickly as possible. Some founders fall in love with fundraising; this is always bad. It’s best to have just one founder do it so the company doesn’t grind to a halt.\n\nRemember that most VCs don’t know much about most industries. Metrics are always the most convincing.\n\nIt’s beginning to change, but most investors (Y Combinator being a notable exception) unfortunately still require introductions from people you both know to take you seriously.\n\nInsist on clean terms (complicated terms compound and get worse each round) but don’t over-optimize, especially on valuation. Valuation is something quantitative to compete on, and so founders love to compete for the highest valuation. But intermediate valuations don’t matter much.\n\nThe first check is the hardest to get, so focus your energies on getting that, which usually means focusing your attention on whoever loves you the most. Always have multiple plans, one of which is not raising anything, and be flexible depending on interest—if you can put more money to good use, and it’s available on reasonable terms, be open to taking it.\n\nAn important key to being good at pitching is to make your story as clear and easy to understand as possible. Of course, the most important key is to actually have a good company. There are lots of thoughts about what to include in a pitch, but at a minimum you need to have: mission, problem, product/service, business model, team, market and market growth rate, and financials.\n\nRemember that the bar for each round of funding is much higher. If you got away with just being a compelling presenter for your seed round, don’t be surprised when it doesn’t work for your Series A.\n\nGood investors really do add a lot of value. Bad investors detract a lot. Most investors fall in the middle and neither add nor detract. Investors that only invest a small amount usually don’t do anything for you (i.e., beware party rounds).\n\nGreat board members are one of the best outside forcing functions for a company other than users, and outside forcing functions are worth more than most founders think. Be willing to accept a lower valuation to get a great board member who is willing to be very involved.\n\nI think [this essay by Paul Graham](http://paulgraham.com/fr.html) is the best thing out there on fundraising.\n\nRemember that at least a thousand people have every great idea. One of them actually becomes successful. The difference comes down to execution. It’s a grind, and everyone wishes there were some other way to transform “idea” into “success”, but no one has figured it out yet.\n\nSo all you need is a great idea, a great team, a great product, and great execution. So easy! ;)\n\n*Thanks to Paul Buchheit, Erica Carpenter, Brian Chesky, Adam D’Angelo, Drew Houston, Justin Kan, Matt Krisiloff, Aaron Levie, Gabriel Leydon, Jessica Livingston, Dustin Moskovitz, David Rusenko and Colleen Taylor for contributing thoughts to this.*\n\nBack to **Table of Contents**",
        "metadata": {
          "url": "https://playbook.samaltman.com/",
          "platform": "generic",
          "title": "Startup Playbook",
          "author": null,
          "excerpt": "To have a successful startup, you need: a great idea, a great market, a great team, a great product, and great execution.",
          "length": 44596,
          "site_name": "Sam Altman",
          "extraction_method": "readability"
        },
        "output_path": "/Users/oalanicolas/Documents/Code/mente_lendaria/docs/minds/sam_altman/sources/downloads/blogs/T1-007.md",
        "validation": {
          "score": 90,
          "acceptable": true,
          "issues": [
            "Missing author and date"
          ],
          "markdownQuality": {
            "score": 85,
            "wordCount": 7842,
            "lineCount": 339,
            "hasHeadings": true,
            "hasLinks": true,
            "hasFrontmatter": false,
            "issues": [],
            "acceptable": true
          }
        }
      },
      "error": null,
      "started_at": 1760221907744,
      "completed_at": 1760221908750,
      "duration": 1006
    },
    {
      "id": "T1-003",
      "type": "blog",
      "source": {
        "id": "T1-003",
        "title": "Moore's Law for Everything",
        "type": "blog",
        "url": "https://moores.samaltman.com/",
        "tier": 1,
        "priority": "CRITICAL",
        "estimated_pages": 6,
        "temporal_period": "OpenAI CEO (2021)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760221906953,
      "updated_at": 1760221908827,
      "result": {
        "source_id": "T1-003",
        "platform": "generic",
        "markdown": "---\ntitle: \"Moore's Law for Everything\"\nurl: https://moores.samaltman.com/\nauthor: by Sam Altman · March 16, 2021\nplatform: generic\nsource_type: blog\nextracted: 2025-10-11T22:31:48.826Z\nextraction_method: generic\n---\n\nMy work at OpenAI reminds me every day about the magnitude of the socioeconomic change that is coming sooner than most people believe. Software that can think and learn will do more and more of the work that people now do. Even more power will shift from labor to capital. If public policy doesn’t adapt accordingly, most people will end up worse off than they are today.\n\nWe need to design a system that embraces this technological future and taxes the assets that will make up most of the value in that world–companies and land–in order to fairly distribute some of the coming wealth. Doing so can make the society of the future much less divisive and enable everyone to participate in its gains.\n\nIn the next five years, computer programs that can think will read legal documents and give medical advice. In the next decade, they will do assembly-line work and maybe even become companions. And in the decades after that, they will do almost everything, including making new scientific discoveries that will expand our concept of “everything.”\n\nThis technological revolution is unstoppable. And a recursive loop of innovation, as these smart machines themselves help us make smarter machines, will accelerate the revolution’s pace. Three crucial consequences follow:\n\n1. This revolution will create phenomenal wealth. The price of many kinds of labor (which drives the costs of goods and services) will fall toward zero once sufficiently powerful AI “joins the workforce.”\n\n2. The world will change so rapidly and drastically that an equally drastic change in policy will be needed to distribute this wealth and enable more people to pursue the life they want.\n\n3. If we get both of these right, we can improve the standard of living for people more than we ever have before.\n\n\nBecause we are at the beginning of this tectonic shift, we have a rare opportunity to pivot toward the future. That pivot can’t simply address current social and political problems; it must be designed for the radically different society of the near future. Policy plans that don’t account for this imminent transformation will fail for the same reason that the organizing principles of pre-agrarian or feudal societies would fail today.\n\nWhat follows is a description of what’s coming and a plan for how to navigate this new landscape.\n\nPart 1\n\n## The AI Revolution\n\nOn a zoomed-out time scale, technological progress follows an exponential curve. Compare how the world looked 15 years ago (no smartphones, really), 150 years ago (no combustion engine, no home electricity), 1,500 years ago (no industrial machines), and 15,000 years ago (no agriculture).\n\nThe coming change will center around the most impressive of our capabilities: the phenomenal ability to think, create, understand, and reason. To the three great technological revolutions–the agricultural, the industrial, and the computational–we will add a fourth: the AI revolution. This revolution will generate enough wealth for everyone to have what they need, if we as a society manage it responsibly.\n\nThe technological progress we make in the next 100 years will be far larger than all we’ve made since we first controlled fire and invented the wheel. We have already built AI systems that can learn and do useful things. They are still primitive, but the trendlines are clear.\n\nPart 2\n\n## Moore's Law for Everything\n\nBroadly speaking, there are two paths to affording a good life: an individual acquires more money (which makes that person wealthier), or prices fall (which makes everyone wealthier). Wealth is buying power: how much we can get with the resources we have.\n\nThe best way to increase societal wealth is to decrease the cost of goods, from food to video games. Technology will rapidly drive that decline in many categories. Consider the example of semiconductors and Moore’s Law: for decades, chips became twice as powerful for the same price about every two years.\n\nIn the last couple of decades, costs in the US for TVs, computers, and entertainment have dropped. But other costs have risen significantly, most notably those for housing, healthcare, and higher education. Redistribution of wealth alone won’t work if these costs continue to soar.\n\nAI will lower the cost of goods and services, because labor is the driving cost at many levels of the supply chain. If robots can build a house on land you already own from natural resources mined and refined onsite, using solar power, the cost of building that house is close to the cost to rent the robots. And if those robots are made by other robots, the cost to rent them will be much less than it was when humans made them.\n\nSimilarly, we can imagine AI doctors that can diagnose health problems better than any human, and AI teachers that can diagnose and explain exactly what a student doesn’t understand.\n\n“Moore’s Law for everything” should be the rallying cry of a generation whose members can’t afford what they want. It sounds utopian, but it’s something technology can deliver (and in some cases already has). Imagine a world where, for decades, everything–housing, education, food, clothing, etc.–became half as expensive every two years.\n\nWe will discover new jobs–we always do after a technological revolution–and because of the abundance on the other side, we will have incredible freedom to be creative about what they are.\n\nPart 3\n\n## Capitalism for Everyone\n\nA stable economic system requires two components: growth and inclusivity. Economic growth matters because most people want their lives to improve every year. In a zero-sum world, one with no or very little growth, democracy can become antagonistic as people seek to vote money away from each other. What follows from that antagonism is distrust and polarization. In a high-growth world the dogfights can be far fewer, because it’s much easier for everyone to win.\n\nEconomic inclusivity means everyone having a reasonable opportunity to get the resources they need to live the life they want. Economic inclusivity matters because it’s fair, produces a stable society, and can create the largest slices of pie for the most people. As a side benefit, it produces more growth.\n\nCapitalism is a powerful engine of economic growth because it rewards people for investing in assets that generate value over time, which is an effective incentive system for creating and distributing technological gains. But the price of progress in capitalism is inequality.\n\nSome inequality is ok–in fact, it’s critical, as shown by all systems that have tried to be perfectly equal–but a society that does not offer sufficient equality of opportunity for everyone to advance is not a society that will last.\n\nThe traditional way to address inequality has been by progressively taxing income. For a variety of reasons, that hasn’t worked very well. It will work much, much worse in the future. While people will still have jobs, many of those jobs won’t be ones that create a lot of economic value in the way we think of value today. As AI produces most of the world’s basic goods and services, people will be freed up to spend more time with people they care about, care for people, appreciate art and nature, or work toward social good.\n\nWe should therefore focus on taxing capital rather than labor, and we should use these taxes as an opportunity to directly distribute ownership and wealth to citizens. In other words, the best way to improve capitalism is to enable everyone to benefit from it directly as an equity owner. This is not a new idea, but it will be newly feasible as AI grows more powerful, because there will be dramatically more wealth to go around. The two dominant sources of wealth will be 1) companies, particularly ones that make use of AI, and 2) land, which has a fixed supply.\n\nThere are many ways to implement these two taxes, and many thoughts about what to do with them. Over a long period of time, perhaps most other taxes could be eliminated. What follows is an idea in the spirit of a conversation starter.\n\nWe could do something called the American Equity Fund. The American Equity Fund would be capitalized by taxing companies above a certain valuation 2.5% of their market value each year, payable in shares transferred to the fund, and by taxing 2.5% of the value of all privately-held land, payable in dollars.\n\nAll citizens over 18 would get an annual distribution, in dollars and company shares, into their accounts. People would be entrusted to use the money however they needed or wanted—for better education, healthcare, housing, starting a company, whatever. Rising costs in government-funded industries would face real pressure as more people chose their own services in a competitive marketplace.\n\nAs long as the country keeps doing better, every citizen would get more money from the Fund every year (on average; there will still be economic cycles). Every citizen would therefore increasingly partake of the freedoms, powers, autonomies, and opportunities that come with economic self-determination. Poverty would be greatly reduced and many more people would have a shot at the life they want.\n\nA tax payable in company shares will align incentives between companies, investors, and citizens, whereas a tax on profits does not–incentives are superpowers, and this is a critical difference. Corporate profits can be disguised or deferred or offshored, and are often disconnected from share price. But everyone who owns a share in Amazon wants the share price to rise. As people’s individual assets rise in tandem with the country’s, they have a literal stake in seeing their country do well.\n\nHenry George, an American political economist, proposed the idea of a land-value tax in the late 1800s. The concept is widely supported by economists. The value of land appreciates because of the work society does around it: the network effects of the companies operating around a piece of land, the public transportation that makes it accessible, and the nearby restaurants, coffeeshops, and access to nature that makes it desirable. Because the landowner didn’t do all that work, it’s fair for that value to be shared with the larger society that did.\n\nIf everyone owns a slice of American value creation, everyone will want America to do better: collective equity in innovation and in the success of the country will align our incentives. The new social contract will be a floor for everyone in exchange for a ceiling for no one, and a shared belief that technology can and must deliver a virtuous circle of societal wealth. (We will continue to need strong leadership from our government to make sure that the desire for stock prices to go up remains balanced with protecting the environment, human rights, etc.)\n\nIn a world where everyone benefits from capitalism as an owner, the collective focus will be on making the world “more good” instead of “less bad.” These approaches are more different than they seem, and society does much better when it focuses on the former. Simply put, more good means optimizing for making the pie as large as possible, and less bad means dividing the pie up as fairly as possible. Both can increase people’s standard of living once, but continuous growth only happens when the pie grows.\n\nPart 4\n\n## Implementation and Troubleshooting\n\nThe amount of wealth available to capitalize the American Equity Fund would be significant. There is about $50 trillion worth of value, as measured by market capitalization, in US companies alone. Assume that, as it has on average over the past century, this will at least double over the next decade.\n\nThere is also about $30 trillion worth of privately-held land in the US (not counting improvements on top of the land). Assume that this value will roughly double, too, over the next decade–this is somewhat faster than the historical rate, but as the world really starts to understand the shifts AI will cause, the value of land, as one of the few truly finite assets, should increase at a faster rate.\n\nOf course, if we increase the tax burden on holding land, its value will diminish relative to other investment assets, which is a good thing for society because it makes a fundamental resource more accessible and encourages investment instead of speculation. The value of companies will diminish in the short-term, too, though they will continue to perform quite well over time.\n\nIt’s a reasonable assumption that such a tax causes a drop in value of land and corporate assets of 15% (which only will take a few years to recover!).\n\nUnder the above set of assumptions (current values, future growth, and the reduction in value from the new tax), a decade from now each of the 250 million adults in America would get about $13,500 every year. That dividend could be much higher if AI accelerates growth, but even if it’s not, $13,500 will have much greater purchasing power than it does now because technology will have greatly reduced the cost of goods and services. And that effective purchasing power will go up dramatically every year.\n\nIt would be easiest for companies to pay the tax each year by issuing new shares representing 2.5% of their value. There would obviously be an incentive for companies to escape the American Equity Fund tax by off-shoring themselves, but a simple test involving a percentage of revenue derived from America could address this concern. A larger problem with this idea is the incentive for companies to return value to shareholders instead of reinvesting it in growth.\n\nIf we tax only public companies, there would also be an incentive for companies to stay private. For private companies that have annual revenue in excess of $1 billion, we could let their tax in equity accrue for a certain (limited) number of years until they go public. If they remain private for a long time, we could let them settle the tax in cash.\n\nWe’d need to design the system to prevent people from consistently voting themselves more money. A constitutional amendment delineating the allowable ranges of the tax would be a strong safeguard. It is important that the tax not be so large that it stifles growth–for example, the tax on companies must be much smaller than their average growth rate.\n\nWe’d also need a robust system for quantifying the actual value of land. One way would be with a corps of powerful federal assessors. Another would be to let local governments do the assessing, as they now do to determine property taxes. They would continue to receive local taxes using the same assessed value. However, if a certain percentage of sales in a jurisdiction in any given year falls too far above or below the local government’s estimate of the property’s values, then all the other properties in their jurisdiction would be reassessed up or down.\n\nThe theoretically optimal system would be to tax the value of the land only, and not the improvements built on top of it. In practice, this value may turn out to be too difficult to assess, so we may need to tax the value of the land and the improvements on it (at a lower rate, as the combined value would be higher).\n\nFinally, we couldn’t let people borrow against, sell, or otherwise pledge their future Fund distributions, or we won’t really solve the problem of fairly distributing wealth over time. The government can simply make such transactions unenforceable.\n\nPart 5\n\n## Shifting to the New System\n\nA great future isn’t complicated: we need technology to create more wealth, and policy to fairly distribute it. Everything necessary will be cheap, and everyone will have enough money to be able to afford it. As this system will be enormously popular, policymakers who embrace it early will be rewarded: they will themselves become enormously popular.\n\nIn the Great Depression, Franklin Roosevelt was able to enact a huge social safety net that no one would have thought possible five years earlier. We are in a similar moment now. So a movement that is both pro-business and pro-people will unite a remarkably broad constituency.\n\nA politically feasible way to launch the American Equity Fund, and one that would reduce the transitional shock, would be with legislation that transitions us gradually to the 2.5% rates. The full 2.5% rate would only take hold once GDP increases by 50% from the time the law is passed. Starting with small distributions soon will be both motivating and helpful in getting people comfortable with a new future. Achieving 50% GDP growth sounds like it would take a long time (it took 13 years for the economy to grow 50% to its 2019 level). But once AI starts to arrive, growth will be extremely rapid. Down the line, we will probably be able to reduce a lot of other taxes as we tax these two fundamental asset classes.\n\nThe changes coming are unstoppable. If we embrace them and plan for them, we can use them to create a much fairer, happier, and more prosperous society. The future can be almost unimaginably great.\n\nThanks to Steven Adler, Daniela Amodei, Adam Baybutt, Chris Beiser, Jack Clark, Ryan Cohen, Tyler Cowen, Matt Danzeisen, Steve Dowling, Tad Friend, Lachy Groom, Chris Hallacy, Reid Hoffman, Ingmar Kanitscheider, Oleg Klimov, Matt Knight, Aris Konstantinidis, Andrew Kortina, Matt Krisiloff, Scott Krisiloff, John Luttig, Erik Madsen, Preston McAfee, Luke Miles, Arvind Neelakantan, David Oates, Cullen O’Keefe, Alethea Power, Raul Puri, Ilya Sutskever, Luke Walsh, Caleb Watney, and Wojchiech Zaremba for reviewing drafts of this, and to Gregory Koberger for designing it.",
        "metadata": {
          "url": "https://moores.samaltman.com/",
          "platform": "generic",
          "title": "Moore's Law for Everything",
          "author": "by Sam Altman · March 16, 2021",
          "excerpt": "We need to design a system that embraces this technological future and taxes the assets that will make up most of the value in that world–companies and land–in order to fairly distribute some of the coming wealth.",
          "length": 17418,
          "site_name": null,
          "extraction_method": "readability"
        },
        "output_path": "/Users/oalanicolas/Documents/Code/mente_lendaria/docs/minds/sam_altman/sources/downloads/blogs/T1-003.md",
        "validation": {
          "score": 100,
          "acceptable": true,
          "issues": [],
          "markdownQuality": {
            "score": 70,
            "wordCount": 2912,
            "lineCount": 118,
            "hasHeadings": true,
            "hasLinks": false,
            "hasFrontmatter": false,
            "issues": [],
            "acceptable": true
          }
        }
      },
      "error": null,
      "started_at": 1760221906953,
      "completed_at": 1760221908827,
      "duration": 1874
    },
    {
      "id": "T1-009",
      "type": "blog",
      "source": {
        "id": "T1-009",
        "title": "Idea Generation",
        "type": "blog",
        "url": "https://blog.samaltman.com/idea-generation",
        "tier": 1,
        "priority": "HIGH",
        "estimated_pages": 2,
        "temporal_period": "YC President (2017)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760221906954,
      "updated_at": 1760221914365,
      "result": {
        "source_id": "T1-009",
        "platform": "medium",
        "markdown": "---\ntitle: \"Idea Generation\"\nurl: https://blog.samaltman.com/idea-generation\nplatform: medium\nsource_type: blog\nextracted: 2025-10-11T22:31:54.364Z\nextraction_method: medium\n---\n\nThe most common question prospective startup founders ask is how to get ideas for startups. The second most common question is if you have any ideas for their startup.\n\nBut giving founders an idea almost always doesn’t work. Having ideas is among the most important qualities for a startup founder to have—you will need to generate lots of new ideas in the course of running a startup.\n\nYC once tried an experiment of funding seemingly good founders with no ideas. I think every company in this no-idea track failed. It turns out that good founders have lots of ideas about everything, so if you want to be a founder and can’t get an idea for a company, you should probably work on getting good at idea generation first.\n\nHow do you do that?\n\nIt’s important to be in the right kind of environment, and around the right kind of people. You want to be around people who have a good feel for the future, will entertain improbable plans, are optimistic, are smart in a creative way, and have a very high idea flux. These sorts of people tend to think without the constraints most people have, not have a lot of filters, and not care too much what other people think.\n\nThe best ideas are fragile; most people don’t even start talking about them at all because they sound silly. Perhaps most of all, you want to be around people who don’t make you feel stupid for mentioning a bad idea, and who certainly never feel stupid for doing so themselves.\n\nStay away from people who are world-weary and belittle your ambitions. Unfortunately, this is most of the world. But they hold on to the past, and you want to live in the future.\n\nYou want to be able to project yourself 20 years into the future, and then think backwards from there. Trust yourself—20 years is a long time; it’s ok if your ideas about it seem pretty radical.\n\nAnother way to do this is to think about the most important tectonic shifts happening right now. How is the world changing in fundamental ways? Can you identify a leading edge of change and an opportunity that it unlocks? The mobile phone explosion from 2008-2012 is the most recent significant example of this—we are overdue for another!\n\nIn such a tectonic shift, the world changes so fast that the big incumbents usually get beaten by fast-moving and focused startups. (By the way, it’s useful to get good at differentiating between real trends and fake trends. A key differentiator is if the new platform is used a lot by a small number of people, or used a little by a lot of people.)\n\nAny time you can think of something that is possible this year and wasn’t possible last year, you should pay attention. You may have the seed of a great startup idea. This is especially true if next year will be too late.\n\nWhen you can say “I am sure this is going to happen, I’m just not sure if we’ll be the ones to do it”, that’s a good sign. Uber was like this for me—after the first time I used it, it was clear we weren’t going to be calling cabs for that much longer, but I wasn’t sure that Uber was going to win the space.\n\nA good question to ask yourself early in the process of thinking about an idea is “could this be huge if it worked?” There are many good ideas in the world, but few of them have the inherent advantages that can make a startup massively successful. Most businesses don’t generate a valuable accumulating advantage as they scale. Think early about why an idea might have that property. It’s obvious for Facebook or Airbnb, but it often exists in more subtle ways.\n\nIt’s also important to think about what you’re well-suited for. This is hard to do with pure introspection; ideally you can ask a mentor or some people you’ve worked with what you’re particularly good at. I’ve come to believe that founder/company fit is as important as product/market fit.\n\nFinally, a good test for an idea is if you can articulate why most people think it’s a bad idea, but you understand what makes it good.\n\n*This is from my notes for a talk I gave at a YC event in China in 2018. Thanks to Eric Migicovsky for encouraging me to post it!*\n\n*I wrote it when I thought mostly about startups; now I think mostly about AI development. I am struck by how much of it applies, particularly paragraphs 5-9.*",
        "metadata": {
          "url": "https://blog.samaltman.com/idea-generation",
          "platform": "medium",
          "title": "Idea Generation",
          "author": null,
          "date": null,
          "excerpt": "The most common question prospective startup founders ask is how to get ideas for startups. The second most common question is if you have any ideas for their startup. But giving founders an idea...",
          "categories": [],
          "tags": [],
          "member_only": false,
          "topics": []
        },
        "output_path": "/Users/oalanicolas/Documents/Code/mente_lendaria/docs/minds/sam_altman/sources/downloads/blogs/T1-009.md",
        "validation": {
          "score": 70,
          "acceptable": true,
          "issues": [
            "Missing author and date",
            "Low markdown quality: 40"
          ],
          "markdownQuality": {
            "score": 40,
            "wordCount": 772,
            "lineCount": 33,
            "hasHeadings": false,
            "hasLinks": false,
            "hasFrontmatter": false,
            "issues": [
              "No headings found"
            ],
            "acceptable": false
          }
        }
      },
      "error": null,
      "started_at": 1760221908750,
      "completed_at": 1760221914365,
      "duration": 5615
    },
    {
      "id": "T1-008",
      "type": "blog",
      "source": {
        "id": "T1-008",
        "title": "The Days are Long but the Decades are Short",
        "type": "blog",
        "url": "https://blog.samaltman.com/the-days-are-long-but-the-decades-are-short",
        "tier": 1,
        "priority": "HIGH",
        "estimated_pages": 2,
        "temporal_period": "YC President (2016)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760221906954,
      "updated_at": 1760221914422,
      "result": {
        "source_id": "T1-008",
        "platform": "medium",
        "markdown": "---\ntitle: \"The days are long but the decades are short\"\nurl: https://blog.samaltman.com/the-days-are-long-but-the-decades-are-short\nplatform: medium\nsource_type: blog\nextracted: 2025-10-11T22:31:54.420Z\nextraction_method: medium\n---\n\n*I turned 30 last week and a friend asked me if I'd figured out any life advice in the past decade worth passing on.  I'm somewhat hesitant to publish this because I think these lists usually seem hollow, but here is a cleaned up version of my answer:*\n\n1) Never put your family, friends, or significant other low on your priority list.  Prefer a handful of truly close friends to a hundred acquaintances.  Don’t lose touch with old friends.  Occasionally stay up until the sun rises talking to people.  Have parties.\n\n2) Life is not a dress rehearsal—this is probably it.  Make it count.  Time is extremely limited and goes by fast.  Do what makes you happy and fulfilled—few people get remembered hundreds of years after they die anyway.  Don’t do stuff that doesn’t make you happy (this happens most often when other people want you to do something).  Don’t spend time trying to maintain relationships with people you don’t like, and cut negative people out of your life.  Negativity is really bad.  Don’t let yourself make excuses for not doing the things you want to do.\n\n3) How to succeed: pick the right thing to do (this is critical and usually ignored), focus, believe in yourself (especially when others tell you it’s not going to work), develop personal connections with people that will help you, learn to identify talented people, and work hard.  It’s hard to identify what to work on because original thought is hard.\n\n4) On work: it’s difficult to do a great job on work you don’t care about.  And it’s hard to be totally happy/fulfilled in life if you don’t like what you do for your work.  Work very hard—a surprising number of people will be offended that you choose to work hard—but not so hard that the rest of your life passes you by.  Aim to be the best in the world at whatever you do professionally.  Even if you miss, you’ll probably end up in a pretty good place.  Figure out your own productivity system—don’t waste time being unorganized, working at suboptimal times, etc.  Don’t be afraid to take some career risks, especially early on.  Most people pick their career fairly randomly—really think hard about what you like, what fields are going to be successful, and try to talk to people in those fields.\n\n5) On money: Whether or not money can buy happiness, it can buy freedom, and that’s a big deal.  Also, lack of money is very stressful.  In almost all ways, having enough money so that you don’t stress about paying rent does more to change your wellbeing than having enough money to buy your own jet.  Making money is often more fun than spending it, though I personally have never regretted money I’ve spent on friends, new experiences, saving time, travel, and causes I believe in.\n\n6) Talk to people more.  Read more long content and less tweets.  Watch less TV.  Spend less time on the Internet.\n\n7) Don’t waste time.  Most people waste most of their time, especially in business.\n\n8) Don’t let yourself get pushed around.  As Paul Graham once said to me, “People can become formidable, but it’s hard to predict who”.  (There is a big difference between confident and arrogant.  Aim for the former, obviously.)\n\n9) Have clear goals for yourself every day, every year, and every decade.\n\n10) However, as valuable as planning is, if a great opportunity comes along you should take it.  Don’t be afraid to do something slightly reckless.  One of the benefits of working hard is that good opportunities will come along, but it’s still up to you to jump on them when they do.\n\n11) Go out of your way to be around smart, interesting, ambitious people.  Work for them and hire them (in fact, one of the most satisfying parts of work is forging deep relationships with really good people).  Try to spend time with people who are either among the best in the world at what they do or extremely promising but totally unknown.  It really is true that you become an average of the people you spend the most time with.\n\n12) Minimize your own cognitive load from distracting things that don’t really matter.  It’s hard to overstate how important this is, and how bad most people are at it.  Get rid of distractions in your life.  Develop very strong ways to avoid letting crap you don’t like doing pile up and take your mental cycles, especially in your work life.\n\n13) Keep your personal burn rate low.  This alone will give you a lot of opportunities in life.\n\n14) Summers are the best.\n\n15) Don’t worry so much.  Things in life are rarely as risky as they seem.  Most people are too risk-averse, and so most advice is biased too much towards conservative paths.\n\n16) Ask for what you want.\n\n17) If you think you’re going to regret not doing something, you should probably do it.  Regret is the worst, and most people regret far more things they didn’t do than things they did do.  When in doubt, kiss the boy/girl.\n\n18) Exercise.  Eat well.  Sleep.  Get out into nature with some regularity.\n\n19) Go out of your way to help people.  Few things in life are as satisfying.  Be nice to strangers.  Be nice even when it doesn’t matter.\n\n20) Youth is a really great thing.  Don’t waste it.  In fact, in your 20s, I think it’s ok to take a “Give me financial discipline, but not just yet” attitude.  All the money in the world will never get back time that passed you by.\n\n21) Tell your parents you love them more often.  Go home and visit as often as you can.\n\n22) This too shall pass.\n\n23) Learn voraciously.\n\n24) Do new things often.  This seems to be really important.  Not only does doing new things seem to slow down the perception of time, increase happiness, and keep life interesting, but it seems to prevent people from calcifying in the ways that they think.  Aim to do something big, new, and risky every year in your personal and professional life.\n\n25) Remember how intensely you loved your boyfriend/girlfriend when you were a teenager?  Love him/her that intensely now.  Remember how excited and happy you got about stuff as a kid?  Get that excited and happy now.\n\n26) Don’t screw people and don’t burn bridges.  Pick your battles carefully.\n\n27) Forgive people.\n\n28) Don’t chase status.  Status without substance doesn’t work for long and is unfulfilling.\n\n29) Most things are ok in moderation.  Almost nothing is ok in extreme amounts.\n\n30) Existential angst is part of life.  It is particularly noticeable around major life events or just after major career milestones.  It seems to particularly affect smart, ambitious people.  I think one of the reasons some people work so hard is so they don’t have to spend too much time thinking about this.  Nothing is wrong with you for feeling this way; you are not alone.\n\n31) Be grateful and keep problems in perspective.  Don’t complain too much.  Don’t hate other people’s success (but remember that some people will hate your success, and you have to learn to ignore it).\n\n32) Be a doer, not a talker.\n\n33) Given enough time, it is possible to adjust to almost anything, good or bad.  Humans are remarkable at this.\n\n34) Think for a few seconds before you act.  Think for a few minutes if you’re angry.\n\n35) Don’t judge other people too quickly.  You never know their whole story and why they did or didn’t do something.  Be empathetic.\n\n36) The days are long but the decades are short.",
        "metadata": {
          "url": "https://blog.samaltman.com/the-days-are-long-but-the-decades-are-short",
          "platform": "medium",
          "title": "The days are long but the decades are short",
          "author": null,
          "date": null,
          "excerpt": "I turned 30 last week and a friend asked me if I'd figured out any life advice in the past decade worth passing on. I'm somewhat hesitant to publish this because I think these lists usually seem...",
          "categories": [],
          "tags": [],
          "member_only": false,
          "topics": []
        },
        "output_path": "/Users/oalanicolas/Documents/Code/mente_lendaria/docs/minds/sam_altman/sources/downloads/blogs/T1-008.md",
        "validation": {
          "score": 70,
          "acceptable": true,
          "issues": [
            "Missing author and date",
            "Low markdown quality: 40"
          ],
          "markdownQuality": {
            "score": 40,
            "wordCount": 1284,
            "lineCount": 73,
            "hasHeadings": false,
            "hasLinks": false,
            "hasFrontmatter": false,
            "issues": [
              "No headings found"
            ],
            "acceptable": false
          }
        }
      },
      "error": null,
      "started_at": 1760221908525,
      "completed_at": 1760221914422,
      "duration": 5897
    },
    {
      "id": "T1-010",
      "type": "blog",
      "source": {
        "id": "T1-010",
        "title": "What I Wish Someone Had Told Me",
        "type": "blog",
        "url": "https://blog.samaltman.com/what-i-wish-someone-had-told-me",
        "tier": 1,
        "priority": "HIGH",
        "estimated_pages": 2,
        "temporal_period": "OpenAI CEO (2023)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760221906954,
      "updated_at": 1760221914516,
      "result": {
        "source_id": "T1-010",
        "platform": "medium",
        "markdown": "---\ntitle: \"What I Wish Someone Had Told Me\"\nurl: https://blog.samaltman.com/what-i-wish-someone-had-told-me\nplatform: medium\nsource_type: blog\nextracted: 2025-10-11T22:31:54.511Z\nextraction_method: medium\n---\n\n1. Optimism, obsession, self-belief, raw horsepower and personal connections are how things get started.\n2. Cohesive teams, the right combination of calmness and urgency, and unreasonable commitment are how things get finished. Long-term orientation is in short supply; try not to worry about what people think in the short term, which will get easier over time.\n3. It is easier for a team to do a hard thing that really matters than to do an easy thing that doesn’t really matter; audacious ideas motivate people.\n4. Incentives are superpowers; set them carefully.\n5. Concentrate your resources on a small number of high-conviction bets; this is easy to say but evidently hard to do. You can delete more stuff than you think.\n6. Communicate clearly and concisely.\n7. Fight bullshit and bureaucracy every time you see it and get other people to fight it too. Do not let the org chart get in the way of people working productively together.\n8. Outcomes are what count; don’t let good process excuse bad results.\n9. Spend more time recruiting. Take risks on high-potential people with a fast rate of improvement. Look for evidence of getting stuff done in addition to intelligence.\n10. Superstars are even more valuable than they seem, but you have to evaluate people on their net impact on the performance of the organization.\n11. Fast iteration can make up for a lot; it’s usually ok to be wrong if you iterate quickly. Plans should be measured in decades, execution should be measured in weeks.\n12. Don’t fight the business equivalent of the laws of physics.\n13. Inspiration is perishable and life goes by fast. Inaction is a particularly insidious type of risk.\n14. Scale often has surprising emergent properties.\n15. Compounding exponentials are magic. In particular, you really want to build a business that gets a compounding advantage with scale.\n16. Get back up and keep going.\n17. Working with great people is one of the best parts of life.",
        "metadata": {
          "url": "https://blog.samaltman.com/what-i-wish-someone-had-told-me",
          "platform": "medium",
          "title": "What I Wish Someone Had Told Me",
          "author": null,
          "date": null,
          "excerpt": "Optimism, obsession, self-belief, raw horsepower and personal connections are how things get started. Cohesive teams, the right combination of calmness and urgency, and unreasonable commitment are...",
          "categories": [],
          "tags": [],
          "member_only": false,
          "topics": []
        },
        "output_path": "/Users/oalanicolas/Documents/Code/mente_lendaria/docs/minds/sam_altman/sources/downloads/blogs/T1-010.md",
        "validation": {
          "score": 70,
          "acceptable": true,
          "issues": [
            "Missing author and date",
            "Low markdown quality: 40"
          ],
          "markdownQuality": {
            "score": 40,
            "wordCount": 330,
            "lineCount": 17,
            "hasHeadings": false,
            "hasLinks": false,
            "hasFrontmatter": false,
            "issues": [
              "No headings found"
            ],
            "acceptable": false
          }
        }
      },
      "error": null,
      "started_at": 1760221908827,
      "completed_at": 1760221914516,
      "duration": 5689
    },
    {
      "id": "T1-004",
      "type": "pdf",
      "source": {
        "id": "T1-004",
        "title": "Congressional Testimony - May 16, 2023",
        "type": "pdf",
        "url": "https://www.judiciary.senate.gov/imo/media/doc/2023-05-16%20-%20Bio%20&%20Testimony%20-%20Altman.pdf",
        "tier": 1,
        "priority": "CRITICAL",
        "estimated_pages": 8,
        "temporal_period": "OpenAI CEO (2023)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760221906954,
      "updated_at": 1760221916349,
      "result": {
        "source_id": "T1-004",
        "metadata": {
          "title": "Congressional Testimony - May 16, 2023",
          "url": "https://www.judiciary.senate.gov/imo/media/doc/2023-05-16%20-%20Bio%20&%20Testimony%20-%20Altman.pdf",
          "author": null,
          "creator": null,
          "created_at": null,
          "modified_at": null,
          "language": "en",
          "tags": [],
          "source_type": "pdf"
        },
        "text_path": "/Users/oalanicolas/Documents/Code/mente_lendaria/docs/minds/sam_altman/sources/downloads/pdf/T1-004/text.md",
        "raw_text_path": "/Users/oalanicolas/Documents/Code/mente_lendaria/docs/minds/sam_altman/sources/downloads/pdf/T1-004/text.txt",
        "chapters": [],
        "quality": {
          "score": null,
          "acceptable": false,
          "density_per_page": null,
          "ocr_performed": false
        },
        "ocr_performed": false
      },
      "error": null,
      "started_at": 1760221914516,
      "completed_at": 1760221916349,
      "duration": 1833
    },
    {
      "id": "T1-011",
      "type": "blog",
      "source": {
        "id": "T1-011",
        "title": "Productivity",
        "type": "blog",
        "url": "https://blog.samaltman.com/productivity",
        "tier": 1,
        "priority": "HIGH",
        "estimated_pages": 2,
        "temporal_period": "YC President (2018)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760221906954,
      "updated_at": 1760221920359,
      "result": {
        "source_id": "T1-011",
        "platform": "medium",
        "markdown": "---\ntitle: \"Productivity\"\nurl: https://blog.samaltman.com/productivity\nplatform: medium\nsource_type: blog\nextracted: 2025-10-11T22:32:00.328Z\nextraction_method: medium\n---\n\nI think I am at least somewhat more productive than average, and people sometimes ask me for productivity tips.  So I decided to just write them all down in one place.\n\nCompound growth gets discussed as a financial concept, but it works in careers as well, and it is magic.  A small productivity gain, compounded over 50 years, is worth a lot.  So it’s worth figuring out how to optimize productivity. If you get 10% more done and 1% better every day compared to someone else, the compounded difference is massive.\n\n**What you work on**\n\nIt doesn’t matter how fast you move if it’s in a worthless direction.  Picking the right thing to work on is the most important element of productivity and usually almost ignored.  So think about it more!  Independent thought is hard but it’s something you can get better at with practice.\n\nThe most impressive people I know have strong beliefs about the world, which is rare in the general population.  If you find yourself always agreeing with whomever you last spoke with, that’s bad.  You will of course be wrong sometimes, but develop the confidence to stick with your convictions.  It will let you be courageous when you’re right about something important that most people don’t see.\n\nI make sure to leave enough time in my schedule to think about what to work on.  The best ways for me to do this are reading books, hanging out with interesting people, and spending time in nature.\n\nI’ve learned that I can’t be very productive working on things I don’t care about or don’t like.  So I just try not to put myself in a position where I have to do them (by delegating, avoiding, or something else).  Stuff that you don’t like is a painful drag on morale and momentum.\n\nBy the way, here is an important lesson about delegation: remember that everyone else is also most productive when they’re doing what they like, and do what you’d want other people to do for you—try to figure out who likes (and is good at) doing what, and delegate that way.\n\nIf you find yourself not liking what you’re doing for a long period of time, seriously consider a major job change.  Short-term burnout happens, but if it isn’t resolved with some time off, maybe it’s time to do something you’re more interested in.\n\nI’ve been very fortunate to find work I like so much I’d do it for free, which makes it easy to be really productive.\n\nIt’s important to learn that you can learn anything you want, and that you can get better quickly.  This feels like an unlikely miracle the first few times it happens, but eventually you learn to trust that you can do it.\n\nDoing great work usually requires colleagues of some sort.  Try to be around smart, productive, happy, and positive people that don’t belittle your ambitions.  I love being around people who push me and inspire me to be better.  To the degree you able to, avoid the opposite kind of people—the cost of letting them take up your mental cycles is horrific.\n\nYou have to both pick the right problem and do the work.  There aren’t many shortcuts.  If you’re going to do something really important, you are very likely going to work both smart and hard.  The biggest prizes are heavily competed for.  This isn’t true in every field (there are great mathematicians who never spend that many hours a week working) but it is in most.\n\n**Prioritization**\n\nMy system has three key pillars: “Make sure to get the important shit done”, “Don’t waste time on stupid shit”, and “make a lot of lists”.\n\nI highly recommend using lists.  I make lists of what I want to accomplish each year, each month, and each day.  Lists are very focusing, and they help me with multitasking because I don’t have to keep as much in my head.  If I’m not in the mood for some particular task, I can always find something else I’m excited to do.\n\nI prefer lists written down on paper.  It’s easy to add and remove tasks.  I can access them during meetings without feeling rude.  I re-transcribe lists frequently, which forces me to think about everything on the list and gives me an opportunity to add and remove items.\n\nI don’t bother with categorization or trying to size tasks or anything like that (the most I do is put a star next to really important items).\n\nI try to prioritize in a way that generates momentum.  The more I get done, the better I feel, and then the more I get done.  I like to start and end each day with something I can really make progress on.\n\nI am relentless about getting my most important projects done—I’ve found that if I really want something to happen and I push hard enough, it usually happens.\n\nI try to be ruthless about saying no to stuff, and doing non-critical things in the quickest way possible.  I probably take this too far—for example, I am almost sure I am terse to the point of rudeness when replying to emails.\n\nI generally try to avoid meetings and conferences as I find the time cost to be huge—I get the most value out of time in my office.  However, it is critical that you keep enough space in your schedule to allow for chance encounters and exposure to new people and ideas.  Having an open network is valuable; though probably 90% of the random meetings I take are a waste of time, the other 10% really make up for it.\n\nI find most meetings are best scheduled for 15-20 minutes, or 2 hours.  The default of 1 hour is usually wrong, and leads to a lot of wasted time.\n\nI have different times of day I try to use for different kinds of work.  The first few hours of the morning are definitely my most productive time of the day, so I don’t let anyone schedule anything then.  I try to do meetings in the afternoon.  I take a break, or switch tasks, whenever I feel my attention starting to fade.\n\nI don’t think most people value their time enough—I am surprised by the number of people I know who make $100 an hour and yet will spend a couple of hours doing something they don’t want to do to save $20.\n\nAlso, don’t fall into the trap of productivity porn—chasing productivity for its own sake isn’t helpful.  Many people spend too much time thinking about how to perfectly optimize their system, and not nearly enough asking if they’re working on the right problems.  It doesn’t matter what system you use or if you squeeze out every second if you’re working on the wrong thing.\n\nThe right goal is to allocate your year optimally, not your day.\n\n**Physical factors**\n\nVery likely what is optimal for me won’t be optimal for you.  You’ll have to experiment to find out what works best for your body.  It’s definitely worth doing—it helps in all aspects of life, and you’ll feel a lot better and happier overall.\n\nIt probably took a little bit of my time every week for a few years to arrive at what works best for me, but my sense is if I do a good job at all the below I’m at least 1.5x more productive than if not.\n\nSleep seems to be the most important physical factor in productivity for me.  Some sort of sleep tracker to figure out how to sleep best is helpful.  I’ve found the only thing I’m consistent with are in the set-it-and-forget-it category, and I really like the [Emfit QS+Active](https://www.amazon.com/gp/product/B0158W3E2A/).\n\nI like a cold, dark, quiet room, and a great mattress (I resisted spending a bunch of money on a great mattress for years, which was stupid—it makes a huge difference to my sleep quality.  I love [this one](https://www.tempurpedic.com/shop-mattresses/tempur-contour-elite/v/715/)).  Not eating a lot in the few hours before sleep helps.  Not drinking alcohol helps a lot, though I’m not willing to do that all the time.\n\nI use a [Chili Pad](https://www.chilitechnology.com) to be cold while I sleep if I can’t get the room cold enough, which is great but loud (I set it up to have the cooler unit outside my room).\n\nWhen traveling, I use an [eye mask](https://www.amazon.com/gp/product/B00GSO1D9O/) and [ear plugs](https://www.amazon.com/gp/product/B001J4HB1C).\n\nThis is likely to be controversial, but I take a low dose of sleeping pills (like a third of a normal dose) or a very low dose of cannabis whenever I can’t sleep.  I am a bad sleeper in general, and a particularly bad sleeper when I travel.  It likely has tradeoffs, but so does not sleeping well.  If you can already sleep well, I wouldn’t recommend this.\n\nI use a full spectrum LED light most mornings for about 10-15 minutes while I catch up on email.  It’s great—if you try nothing else in here, this is the thing I’d try.  It’s a ridiculous gain for me.  I like [this one](https://www.amazon.com/gp/product/B075H39NDL/), and it’s easy to travel with.\n\nExercise is probably the second most important physical factor.  I tried a number of different exercise programs for a few months each and the one that seemed best was lifting heavy weights 3x a week for an hour, and high intensity interval training occasionally.  In addition to productivity gains, this is also the exercise program that makes me feel the best overall.\n\nThe third area is nutrition.  I very rarely eat breakfast, so I get about 15 hours of fasting most days (except an espresso when I wake up).  I know this is contrary to most advice, and I suspect it’s not optimal for most people, but it definitely works well for me.\n\nEating lots of sugar is the thing that makes me feel the worst and that I try hardest to avoid.  I also try to avoid foods that aggravate my digestion or spike up inflammation (for example, very spicy foods).  I don’t have much willpower when it comes to sweet things, so I mostly just try to keep junk food out of the house.\n\nI have one big shot of espresso immediately when I wake up and one after lunch.  I assume this is about 200mg total of caffeine per day.  I tried a few other configurations; this was the one that worked by far the best.  I otherwise aggressively avoid stimulants, but I will have more coffee if I’m super tired and really need to get something done.\n\nI’m vegetarian and have been since I was a kid, and I supplement methyl B-12, Omega-3, Iron, and Vitamin D-3.  I got to this list with a year or so of quarterly blood tests; it’s worked for me ever since (I re-test maybe every year and a half or so).  There are many doctors who will happily work with you on a super comprehensive blood test (and services like [WellnessFX](https://www.wellnessfx.com)).  I also go out of my way to drink a lot of protein shakes, which I hate and I wouldn’t do if I weren’t vegetarian.\n\n**Other stuff**\n\nHere’s what I like in a workspace: natural light, quiet, knowing that I won’t be interrupted if I don’t want to be, long blocks of time, and being comfortable and relaxed (I’ve got a beautiful desk with a couple of 4k monitors on it in my office, but I spend almost all my time on my couch with my laptop).\n\nI wrote custom software for the annoying things I have to do frequently, which is great.  I also made an effort to learn to type really fast and the keyboard shortcuts that help with my workflow.\n\nLike most people, I sometimes go through periods of a week or two where I just have no motivation to do anything (I suspect it may have something to do with nutrition).  This sucks and always seems to happen at inconvenient times.  I have not figured out what to do about it besides wait for the fog to lift, and to trust that eventually it always does.  And I generally try to avoid people and situations that put me in bad moods, which is good advice whether you care about productivity or not.\n\nIn general, I think it’s good to overcommit a little bit.  I find that I generally get done what I take on, and if I have a little bit too much to do it makes me more efficient at everything, which is a way to train to avoid distractions (a great habit to build!).  However, overcommitting a lot is disastrous.\n\nDon’t neglect your family and friends for the sake of productivity—that’s a very stupid tradeoff (and very likely a net productivity loss, because you’ll be less happy).  Don’t neglect doing things you love or that clear your head either.\n\nFinally, to repeat one more time: productivity in the wrong direction isn’t worth anything at all.  Think more about what to work on.",
        "metadata": {
          "url": "https://blog.samaltman.com/productivity",
          "platform": "medium",
          "title": "Productivity",
          "author": null,
          "date": null,
          "excerpt": "I think I am at least somewhat more productive than average, and people sometimes ask me for productivity tips. So I decided to just write them all down in one place. Compound growth gets...",
          "categories": [],
          "tags": [],
          "member_only": false,
          "topics": []
        },
        "output_path": "/Users/oalanicolas/Documents/Code/mente_lendaria/docs/minds/sam_altman/sources/downloads/blogs/T1-011.md",
        "validation": {
          "score": 70,
          "acceptable": true,
          "issues": [
            "Missing author and date",
            "Low markdown quality: 55"
          ],
          "markdownQuality": {
            "score": 55,
            "wordCount": 2165,
            "lineCount": 95,
            "hasHeadings": false,
            "hasLinks": true,
            "hasFrontmatter": false,
            "issues": [
              "No headings found"
            ],
            "acceptable": false
          }
        }
      },
      "error": null,
      "started_at": 1760221914365,
      "completed_at": 1760221920359,
      "duration": 5994
    },
    {
      "id": "T1-012",
      "type": "blog",
      "source": {
        "id": "T1-012",
        "title": "Reflections",
        "type": "blog",
        "url": "https://blog.samaltman.com/reflections",
        "tier": 1,
        "priority": "HIGH",
        "estimated_pages": 3,
        "temporal_period": "OpenAI CEO (2025)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760221906954,
      "updated_at": 1760221920360,
      "result": {
        "source_id": "T1-012",
        "platform": "medium",
        "markdown": "---\ntitle: \"Reflections\"\nurl: https://blog.samaltman.com/reflections\nplatform: medium\nsource_type: blog\nextracted: 2025-10-11T22:32:00.358Z\nextraction_method: medium\n---\n\nThe second birthday of ChatGPT was only a little over a month ago, and now we have transitioned into the next paradigm of models that can do complex reasoning. New years get people in a reflective mood, and I wanted to share some personal thoughts about how it has gone so far, and some of the things I’ve learned along the way.\n\nAs we get closer to AGI, it feels like an important time to look at the progress of our company. There is still so much to understand, still so much we don’t know, and it’s still so early. But we know a lot more than we did when we started.\n\nWe started OpenAI almost nine years ago because we believed that AGI was possible, and that it could be the most impactful technology in human history. We wanted to figure out how to build it and make it broadly beneficial; we were excited to try to make our mark on history. Our ambitions were extraordinarily high and so was our belief that the work might benefit society in an equally extraordinary way.\n\nAt the time, very few people cared, and if they did, it was mostly because they thought we had no chance of success.\n\nIn 2022, OpenAI was a quiet research lab working on something temporarily called “Chat With GPT-3.5”. (We are much better at research than we are at naming things.) We had been watching people use the playground feature of our API and knew that developers were really enjoying talking to the model. We thought building a demo around that experience would show people something important about the future and help us make our models better and safer.\n\nWe ended up mercifully calling it ChatGPT instead, and launched it on November 30th of 2022.\n\nWe always knew, abstractly, that at some point we would hit a tipping point and the AI revolution would get kicked off. But we didn’t know what the moment would be. To our surprise, it turned out to be this.\n\nThe launch of ChatGPT kicked off a growth curve like nothing we have ever seen—in our company, our industry, and the world broadly. We are finally seeing some of the massive upside we have always hoped for from AI, and we can see how much more will come soon.\n\nIt hasn’t been easy. The road hasn’t been smooth and the right choices haven’t been obvious.\n\nIn the last two years, we had to build an entire company, almost from scratch, around this new technology. There is no way to train people for this except by doing it, and when the technology category is completely new, there is no one at all who can tell you exactly how it should be done.\n\nBuilding up a company at such high velocity with so little training is a messy process. It’s often two steps forward, one step back (and sometimes, one step forward and two steps back). Mistakes get corrected as you go along, but there aren’t really any handbooks or guideposts when you’re doing original work. Moving at speed in uncharted waters is an incredible experience, but it is also immensely stressful for all the players. Conflicts and misunderstanding abound.\n\nThese years have been the most rewarding, fun, best, interesting, exhausting, stressful, and—particularly for the last two—unpleasant years of my life so far. The overwhelming feeling is gratitude; I know that someday I’ll be retired at our ranch watching the plants grow, a little bored, and will think back at how cool it was that I got to do the work I dreamed of since I was a little kid. I try to remember that on any given Friday, when seven things go badly wrong by 1 pm.\n\nA little over a year ago, on one particular Friday, the main thing that had gone wrong that day was that I got fired by surprise on a video call, and then right after we hung up the board published a blog post about it. I was in a hotel room in Las Vegas. It felt, to a degree that is almost impossible to explain, like a dream gone wrong.\n\nGetting fired in public with no warning kicked off a really crazy few hours, and a pretty crazy few days. The “fog of war” was the strangest part. None of us were able to get satisfactory answers about what had happened, or why.\n\nThe whole event was, in my opinion, a big failure of governance by well-meaning people, myself included. Looking back, I certainly wish I had done things differently, and I’d like to believe I’m a better, more thoughtful leader today than I was a year ago.\n\nI also learned the importance of a board with diverse viewpoints and broad experience in managing a complex set of challenges. Good governance requires a lot of trust and credibility. I appreciate the way so many people worked together to build a stronger system of governance for OpenAI that enables us to pursue our mission of ensuring that AGI benefits all of humanity.\n\nMy biggest takeaway is how much I have to be thankful for and how many people I owe gratitude towards: to everyone who works at OpenAI and has chosen to spend their time and effort going after this dream, to friends who helped us get through the crisis moments, to our partners and customers who supported us and entrusted us to enable their success, and to the people in my life who showed me how much they cared. \\[1\\]\n\nWe all got back to the work in a more cohesive and positive way and I’m very proud of our focus since then. We have done what is easily some of our best research ever. We grew from about 100 million weekly active users to more than 300 million. Most of all, we have continued to put technology out into the world that people genuinely seem to love and that solves real problems.\n\nNine years ago, we really had no idea what we were eventually going to become; even now, we only sort of know. AI development has taken many twists and turns and we expect more in the future.\n\nSome of the twists have been joyful; some have been hard. It’s been fun watching a steady stream of research miracles occur, and a lot of naysayers have become true believers. We’ve also seen some colleagues split off and become competitors. Teams tend to turn over as they scale, and OpenAI scales really fast. I think some of this is unavoidable—startups usually see a lot of turnover at each new major level of scale, and at OpenAI numbers go up by orders of magnitude every few months. The last two years have been like a decade at a normal company. When any company grows and evolves so fast, interests naturally diverge. And when any company in an important industry is in the lead, lots of people attack it for all sorts of reasons, especially when they are trying to compete with it.\n\nOur vision won’t change; our tactics will continue to evolve. For example, when we started we had no idea we would have to build a product company; we thought we were just going to do great research. We also had no idea we would need such a crazy amount of capital. There are new things we have to go build now that we didn’t understand a few years ago, and there will be new things in the future we can barely imagine now.\n\nWe are proud of our track-record on research and deployment so far, and are committed to continuing to advance our thinking on safety and benefits sharing. We continue to believe that the best way to make an AI system safe is by iteratively and gradually releasing it into the world, giving society time to adapt and co-evolve with the technology, learning from experience, and continuing to make the technology safer. We believe in the importance of being world leaders on safety and alignment research, and in guiding that research with feedback from real world applications.\n\nWe are now confident we know how to build AGI as we have traditionally understood it. We believe that, in 2025, we may see the first AI agents “join the workforce” and materially change the output of companies. We continue to believe that iteratively putting great tools in the hands of people leads to great, broadly-distributed outcomes.\n\nWe are beginning to turn our aim beyond that, to superintelligence in the true sense of the word. We love our current products, but we are here for the glorious future. With superintelligence, we can do anything else. Superintelligent tools could massively accelerate scientific discovery and innovation well beyond what we are capable of doing on our own, and in turn massively increase abundance and prosperity.\n\nThis sounds like science fiction right now, and somewhat crazy to even talk about it. That’s alright—we’ve been there before and we’re OK with being there again. We’re pretty confident that in the next few years, everyone will see what we see, and that the need to act with great care, while still maximizing broad benefit and empowerment, is so important. Given the possibilities of our work, OpenAI cannot be a normal company.\n\nHow lucky and humbling it is to be able to play a role in this work.\n\n(Thanks to [Josh Tyrangiel for sort of prompting this](https://www.bloomberg.com/features/2025-sam-altman-interview/). I wish we had had a lot more time.)\n\n\\[1\\]\n\nThere were a lot of people who did incredible and gigantic amounts of work to help OpenAI, and me personally, during those few days, but two people stood out from all others.\n\nRon Conway and Brian Chesky went so far above and beyond the call of duty that I’m not even sure how to describe it. I’ve of course heard stories about Ron’s ability and tenaciousness for years and I’ve spent a lot of time with Brian over the past couple of years getting a huge amount of help and advice.\n\nBut there’s nothing quite like being in the foxhole with people to see what they can really do. I am reasonably confident OpenAI would have fallen apart without their help; they worked around the clock for days until things were done.\n\nAlthough they worked unbelievably hard, they stayed calm and had clear strategic thought and great advice throughout. They stopped me from making several mistakes and made none themselves. They used their vast networks for everything needed and were able to navigate many complex situations. And I’m sure they did a lot of things I don’t know about.\n\nWhat I will remember most, though, is their care, compassion, and support.\n\nI thought I knew what it looked like to support a founder and a company, and in some small sense I did. But I have never before seen, or even heard of, anything like what these guys did, and now I get more fully why they have the legendary status they do. They are different and both fully deserve their genuinely unique reputations, but they are similar in their remarkable ability to move mountains and help, and in their unwavering commitment in times of need. The tech industry is far better off for having both of them in it.\n\nThere are others like them; it is an amazingly special thing about our industry and does much more to make it all work than people realize. I look forward to paying it forward.\n\nOn a more personal note, thanks especially to Ollie for his support that weekend and always; he is incredible in every way and no one could ask for a better partner.",
        "metadata": {
          "url": "https://blog.samaltman.com/reflections",
          "platform": "medium",
          "title": "Reflections",
          "author": null,
          "date": null,
          "excerpt": "The second birthday of ChatGPT was only a little over a month ago, and now we have transitioned into the next paradigm of models that can do complex reasoning. New years get people in a reflective...",
          "categories": [],
          "tags": [],
          "member_only": false,
          "topics": []
        },
        "output_path": "/Users/oalanicolas/Documents/Code/mente_lendaria/docs/minds/sam_altman/sources/downloads/blogs/T1-012.md",
        "validation": {
          "score": 70,
          "acceptable": true,
          "issues": [
            "Missing author and date",
            "Low markdown quality: 55"
          ],
          "markdownQuality": {
            "score": 55,
            "wordCount": 1950,
            "lineCount": 71,
            "hasHeadings": false,
            "hasLinks": true,
            "hasFrontmatter": false,
            "issues": [
              "No headings found"
            ],
            "acceptable": false
          }
        }
      },
      "error": null,
      "started_at": 1760221914422,
      "completed_at": 1760221920360,
      "duration": 5938
    },
    {
      "id": "T1-003",
      "type": "blog",
      "source": {
        "id": "T1-003",
        "title": "Moore's Law for Everything",
        "type": "blog",
        "url": "https://moores.samaltman.com/",
        "tier": 1,
        "priority": "CRITICAL",
        "estimated_pages": 6,
        "temporal_period": "OpenAI CEO (2021)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760223433015,
      "updated_at": 1760223433699,
      "result": {
        "source_id": "T1-003",
        "platform": "generic",
        "markdown": "---\ntitle: \"Moore's Law for Everything\"\nurl: https://moores.samaltman.com/\nauthor: by Sam Altman · March 16, 2021\nplatform: generic\nsource_type: blog\nextracted: 2025-10-11T22:57:13.696Z\nextraction_method: generic\n---\n\nMy work at OpenAI reminds me every day about the magnitude of the socioeconomic change that is coming sooner than most people believe. Software that can think and learn will do more and more of the work that people now do. Even more power will shift from labor to capital. If public policy doesn’t adapt accordingly, most people will end up worse off than they are today.\n\nWe need to design a system that embraces this technological future and taxes the assets that will make up most of the value in that world–companies and land–in order to fairly distribute some of the coming wealth. Doing so can make the society of the future much less divisive and enable everyone to participate in its gains.\n\nIn the next five years, computer programs that can think will read legal documents and give medical advice. In the next decade, they will do assembly-line work and maybe even become companions. And in the decades after that, they will do almost everything, including making new scientific discoveries that will expand our concept of “everything.”\n\nThis technological revolution is unstoppable. And a recursive loop of innovation, as these smart machines themselves help us make smarter machines, will accelerate the revolution’s pace. Three crucial consequences follow:\n\n1. This revolution will create phenomenal wealth. The price of many kinds of labor (which drives the costs of goods and services) will fall toward zero once sufficiently powerful AI “joins the workforce.”\n\n2. The world will change so rapidly and drastically that an equally drastic change in policy will be needed to distribute this wealth and enable more people to pursue the life they want.\n\n3. If we get both of these right, we can improve the standard of living for people more than we ever have before.\n\n\nBecause we are at the beginning of this tectonic shift, we have a rare opportunity to pivot toward the future. That pivot can’t simply address current social and political problems; it must be designed for the radically different society of the near future. Policy plans that don’t account for this imminent transformation will fail for the same reason that the organizing principles of pre-agrarian or feudal societies would fail today.\n\nWhat follows is a description of what’s coming and a plan for how to navigate this new landscape.\n\nPart 1\n\n## The AI Revolution\n\nOn a zoomed-out time scale, technological progress follows an exponential curve. Compare how the world looked 15 years ago (no smartphones, really), 150 years ago (no combustion engine, no home electricity), 1,500 years ago (no industrial machines), and 15,000 years ago (no agriculture).\n\nThe coming change will center around the most impressive of our capabilities: the phenomenal ability to think, create, understand, and reason. To the three great technological revolutions–the agricultural, the industrial, and the computational–we will add a fourth: the AI revolution. This revolution will generate enough wealth for everyone to have what they need, if we as a society manage it responsibly.\n\nThe technological progress we make in the next 100 years will be far larger than all we’ve made since we first controlled fire and invented the wheel. We have already built AI systems that can learn and do useful things. They are still primitive, but the trendlines are clear.\n\nPart 2\n\n## Moore's Law for Everything\n\nBroadly speaking, there are two paths to affording a good life: an individual acquires more money (which makes that person wealthier), or prices fall (which makes everyone wealthier). Wealth is buying power: how much we can get with the resources we have.\n\nThe best way to increase societal wealth is to decrease the cost of goods, from food to video games. Technology will rapidly drive that decline in many categories. Consider the example of semiconductors and Moore’s Law: for decades, chips became twice as powerful for the same price about every two years.\n\nIn the last couple of decades, costs in the US for TVs, computers, and entertainment have dropped. But other costs have risen significantly, most notably those for housing, healthcare, and higher education. Redistribution of wealth alone won’t work if these costs continue to soar.\n\nAI will lower the cost of goods and services, because labor is the driving cost at many levels of the supply chain. If robots can build a house on land you already own from natural resources mined and refined onsite, using solar power, the cost of building that house is close to the cost to rent the robots. And if those robots are made by other robots, the cost to rent them will be much less than it was when humans made them.\n\nSimilarly, we can imagine AI doctors that can diagnose health problems better than any human, and AI teachers that can diagnose and explain exactly what a student doesn’t understand.\n\n“Moore’s Law for everything” should be the rallying cry of a generation whose members can’t afford what they want. It sounds utopian, but it’s something technology can deliver (and in some cases already has). Imagine a world where, for decades, everything–housing, education, food, clothing, etc.–became half as expensive every two years.\n\nWe will discover new jobs–we always do after a technological revolution–and because of the abundance on the other side, we will have incredible freedom to be creative about what they are.\n\nPart 3\n\n## Capitalism for Everyone\n\nA stable economic system requires two components: growth and inclusivity. Economic growth matters because most people want their lives to improve every year. In a zero-sum world, one with no or very little growth, democracy can become antagonistic as people seek to vote money away from each other. What follows from that antagonism is distrust and polarization. In a high-growth world the dogfights can be far fewer, because it’s much easier for everyone to win.\n\nEconomic inclusivity means everyone having a reasonable opportunity to get the resources they need to live the life they want. Economic inclusivity matters because it’s fair, produces a stable society, and can create the largest slices of pie for the most people. As a side benefit, it produces more growth.\n\nCapitalism is a powerful engine of economic growth because it rewards people for investing in assets that generate value over time, which is an effective incentive system for creating and distributing technological gains. But the price of progress in capitalism is inequality.\n\nSome inequality is ok–in fact, it’s critical, as shown by all systems that have tried to be perfectly equal–but a society that does not offer sufficient equality of opportunity for everyone to advance is not a society that will last.\n\nThe traditional way to address inequality has been by progressively taxing income. For a variety of reasons, that hasn’t worked very well. It will work much, much worse in the future. While people will still have jobs, many of those jobs won’t be ones that create a lot of economic value in the way we think of value today. As AI produces most of the world’s basic goods and services, people will be freed up to spend more time with people they care about, care for people, appreciate art and nature, or work toward social good.\n\nWe should therefore focus on taxing capital rather than labor, and we should use these taxes as an opportunity to directly distribute ownership and wealth to citizens. In other words, the best way to improve capitalism is to enable everyone to benefit from it directly as an equity owner. This is not a new idea, but it will be newly feasible as AI grows more powerful, because there will be dramatically more wealth to go around. The two dominant sources of wealth will be 1) companies, particularly ones that make use of AI, and 2) land, which has a fixed supply.\n\nThere are many ways to implement these two taxes, and many thoughts about what to do with them. Over a long period of time, perhaps most other taxes could be eliminated. What follows is an idea in the spirit of a conversation starter.\n\nWe could do something called the American Equity Fund. The American Equity Fund would be capitalized by taxing companies above a certain valuation 2.5% of their market value each year, payable in shares transferred to the fund, and by taxing 2.5% of the value of all privately-held land, payable in dollars.\n\nAll citizens over 18 would get an annual distribution, in dollars and company shares, into their accounts. People would be entrusted to use the money however they needed or wanted—for better education, healthcare, housing, starting a company, whatever. Rising costs in government-funded industries would face real pressure as more people chose their own services in a competitive marketplace.\n\nAs long as the country keeps doing better, every citizen would get more money from the Fund every year (on average; there will still be economic cycles). Every citizen would therefore increasingly partake of the freedoms, powers, autonomies, and opportunities that come with economic self-determination. Poverty would be greatly reduced and many more people would have a shot at the life they want.\n\nA tax payable in company shares will align incentives between companies, investors, and citizens, whereas a tax on profits does not–incentives are superpowers, and this is a critical difference. Corporate profits can be disguised or deferred or offshored, and are often disconnected from share price. But everyone who owns a share in Amazon wants the share price to rise. As people’s individual assets rise in tandem with the country’s, they have a literal stake in seeing their country do well.\n\nHenry George, an American political economist, proposed the idea of a land-value tax in the late 1800s. The concept is widely supported by economists. The value of land appreciates because of the work society does around it: the network effects of the companies operating around a piece of land, the public transportation that makes it accessible, and the nearby restaurants, coffeeshops, and access to nature that makes it desirable. Because the landowner didn’t do all that work, it’s fair for that value to be shared with the larger society that did.\n\nIf everyone owns a slice of American value creation, everyone will want America to do better: collective equity in innovation and in the success of the country will align our incentives. The new social contract will be a floor for everyone in exchange for a ceiling for no one, and a shared belief that technology can and must deliver a virtuous circle of societal wealth. (We will continue to need strong leadership from our government to make sure that the desire for stock prices to go up remains balanced with protecting the environment, human rights, etc.)\n\nIn a world where everyone benefits from capitalism as an owner, the collective focus will be on making the world “more good” instead of “less bad.” These approaches are more different than they seem, and society does much better when it focuses on the former. Simply put, more good means optimizing for making the pie as large as possible, and less bad means dividing the pie up as fairly as possible. Both can increase people’s standard of living once, but continuous growth only happens when the pie grows.\n\nPart 4\n\n## Implementation and Troubleshooting\n\nThe amount of wealth available to capitalize the American Equity Fund would be significant. There is about $50 trillion worth of value, as measured by market capitalization, in US companies alone. Assume that, as it has on average over the past century, this will at least double over the next decade.\n\nThere is also about $30 trillion worth of privately-held land in the US (not counting improvements on top of the land). Assume that this value will roughly double, too, over the next decade–this is somewhat faster than the historical rate, but as the world really starts to understand the shifts AI will cause, the value of land, as one of the few truly finite assets, should increase at a faster rate.\n\nOf course, if we increase the tax burden on holding land, its value will diminish relative to other investment assets, which is a good thing for society because it makes a fundamental resource more accessible and encourages investment instead of speculation. The value of companies will diminish in the short-term, too, though they will continue to perform quite well over time.\n\nIt’s a reasonable assumption that such a tax causes a drop in value of land and corporate assets of 15% (which only will take a few years to recover!).\n\nUnder the above set of assumptions (current values, future growth, and the reduction in value from the new tax), a decade from now each of the 250 million adults in America would get about $13,500 every year. That dividend could be much higher if AI accelerates growth, but even if it’s not, $13,500 will have much greater purchasing power than it does now because technology will have greatly reduced the cost of goods and services. And that effective purchasing power will go up dramatically every year.\n\nIt would be easiest for companies to pay the tax each year by issuing new shares representing 2.5% of their value. There would obviously be an incentive for companies to escape the American Equity Fund tax by off-shoring themselves, but a simple test involving a percentage of revenue derived from America could address this concern. A larger problem with this idea is the incentive for companies to return value to shareholders instead of reinvesting it in growth.\n\nIf we tax only public companies, there would also be an incentive for companies to stay private. For private companies that have annual revenue in excess of $1 billion, we could let their tax in equity accrue for a certain (limited) number of years until they go public. If they remain private for a long time, we could let them settle the tax in cash.\n\nWe’d need to design the system to prevent people from consistently voting themselves more money. A constitutional amendment delineating the allowable ranges of the tax would be a strong safeguard. It is important that the tax not be so large that it stifles growth–for example, the tax on companies must be much smaller than their average growth rate.\n\nWe’d also need a robust system for quantifying the actual value of land. One way would be with a corps of powerful federal assessors. Another would be to let local governments do the assessing, as they now do to determine property taxes. They would continue to receive local taxes using the same assessed value. However, if a certain percentage of sales in a jurisdiction in any given year falls too far above or below the local government’s estimate of the property’s values, then all the other properties in their jurisdiction would be reassessed up or down.\n\nThe theoretically optimal system would be to tax the value of the land only, and not the improvements built on top of it. In practice, this value may turn out to be too difficult to assess, so we may need to tax the value of the land and the improvements on it (at a lower rate, as the combined value would be higher).\n\nFinally, we couldn’t let people borrow against, sell, or otherwise pledge their future Fund distributions, or we won’t really solve the problem of fairly distributing wealth over time. The government can simply make such transactions unenforceable.\n\nPart 5\n\n## Shifting to the New System\n\nA great future isn’t complicated: we need technology to create more wealth, and policy to fairly distribute it. Everything necessary will be cheap, and everyone will have enough money to be able to afford it. As this system will be enormously popular, policymakers who embrace it early will be rewarded: they will themselves become enormously popular.\n\nIn the Great Depression, Franklin Roosevelt was able to enact a huge social safety net that no one would have thought possible five years earlier. We are in a similar moment now. So a movement that is both pro-business and pro-people will unite a remarkably broad constituency.\n\nA politically feasible way to launch the American Equity Fund, and one that would reduce the transitional shock, would be with legislation that transitions us gradually to the 2.5% rates. The full 2.5% rate would only take hold once GDP increases by 50% from the time the law is passed. Starting with small distributions soon will be both motivating and helpful in getting people comfortable with a new future. Achieving 50% GDP growth sounds like it would take a long time (it took 13 years for the economy to grow 50% to its 2019 level). But once AI starts to arrive, growth will be extremely rapid. Down the line, we will probably be able to reduce a lot of other taxes as we tax these two fundamental asset classes.\n\nThe changes coming are unstoppable. If we embrace them and plan for them, we can use them to create a much fairer, happier, and more prosperous society. The future can be almost unimaginably great.\n\nThanks to Steven Adler, Daniela Amodei, Adam Baybutt, Chris Beiser, Jack Clark, Ryan Cohen, Tyler Cowen, Matt Danzeisen, Steve Dowling, Tad Friend, Lachy Groom, Chris Hallacy, Reid Hoffman, Ingmar Kanitscheider, Oleg Klimov, Matt Knight, Aris Konstantinidis, Andrew Kortina, Matt Krisiloff, Scott Krisiloff, John Luttig, Erik Madsen, Preston McAfee, Luke Miles, Arvind Neelakantan, David Oates, Cullen O’Keefe, Alethea Power, Raul Puri, Ilya Sutskever, Luke Walsh, Caleb Watney, and Wojchiech Zaremba for reviewing drafts of this, and to Gregory Koberger for designing it.",
        "metadata": {
          "url": "https://moores.samaltman.com/",
          "platform": "generic",
          "title": "Moore's Law for Everything",
          "author": "by Sam Altman · March 16, 2021",
          "excerpt": "We need to design a system that embraces this technological future and taxes the assets that will make up most of the value in that world–companies and land–in order to fairly distribute some of the coming wealth.",
          "length": 17418,
          "site_name": null,
          "extraction_method": "readability"
        },
        "output_path": "../../docs/minds/sam_altman/sources/downloads/blogs/moores-law-for-everything.md",
        "validation": {
          "score": 100,
          "acceptable": true,
          "issues": [],
          "markdownQuality": {
            "score": 70,
            "wordCount": 2912,
            "lineCount": 118,
            "hasHeadings": true,
            "hasLinks": false,
            "hasFrontmatter": false,
            "issues": [],
            "acceptable": true
          }
        }
      },
      "error": null,
      "started_at": 1760223433015,
      "completed_at": 1760223433699,
      "duration": 684
    },
    {
      "id": "T1-001",
      "type": "blog",
      "source": {
        "id": "T1-001",
        "title": "How to Be Successful",
        "type": "blog",
        "url": "https://blog.samaltman.com/how-to-be-successful",
        "tier": 1,
        "priority": "CRITICAL",
        "estimated_pages": 3,
        "temporal_period": "YC President (2019)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760223433000,
      "updated_at": 1760223433785,
      "result": {
        "source_id": "T1-001",
        "platform": "medium",
        "markdown": "---\ntitle: \"How To Be Successful\"\nurl: https://blog.samaltman.com/how-to-be-successful\nplatform: medium\nsource_type: blog\nextracted: 2025-10-11T22:57:13.783Z\nextraction_method: medium\n---\n\nI’ve observed thousands of founders and thought a lot about what it takes to make a huge amount of money or to create something important. Usually, people start off wanting the former and end up wanting the latter.\n\nHere are 13 thoughts about how to achieve such outlier success. Everything here is easier to do once you’ve already reached a baseline degree of success (through privilege or effort) and want to put in the work to turn that into outlier success. \\[1\\] But much of it applies to anyone.\n\n**1\\. Compound yourself**\n\nCompounding is magic. Look for it everywhere. Exponential curves are the key to wealth generation.\n\nA medium-sized business that grows 50% in value every year becomes huge in a very short amount of time. Few businesses in the world have true network effects and extreme scalability. But with technology, more and more will.  It’s worth a lot of effort to find them and create them.\n\nYou also want to be an exponential curve yourself—you should aim for your life to follow an ever-increasing up-and-to-the-right trajectory. It’s important to move towards a career that has a compounding effect—most careers progress fairly linearly.\n\nYou don't want to be in a career where people who have been doing it for two years can be as effective as people who have been doing it for twenty—your rate of learning should always be high. As your career progresses, each unit of work you do should generate more and more results. There are many ways to get this leverage, such as capital, technology, brand, network effects, and managing people.\n\nIt’s useful to focus on adding another zero to whatever you define as your success metric—money, status, impact on the world, or whatever. I am willing to take as much time as needed between projects to find my next thing. But I always want it to be a project that, if successful, will make the rest of my career look like a footnote.\n\nMost people get bogged down in linear opportunities. Be willing to let small opportunities go to focus on potential step changes.\n\nI think the biggest competitive advantage in business—either for a company or for an individual’s career—is long-term thinking with a broad view of how different systems in the world are going to come together. One of the notable aspects of compound growth is that the furthest out years are the most important. In a world where almost no one takes a truly long-term view, the market richly rewards those who do.\n\nTrust the exponential, be patient, and be pleasantly surprised.\n\n**2\\. Have almost too much self-belief**\n\nSelf-belief is immensely powerful. The most successful people I know believe in themselves almost to the point of delusion.\n\nCultivate this early. As you get more data points that your judgment is good and you can consistently deliver results, trust yourself more.\n\nIf you don’t believe in yourself, it’s hard to let yourself have contrarian ideas about the future. But this is where most value gets created.\n\nI remember when Elon Musk took me on a tour of the SpaceX factory many years ago. He talked in detail about manufacturing every part of the rocket, but the thing that sticks in memory was the look of absolute certainty on his face when he talked about sending large rockets to Mars. I left thinking “huh, so that’s the benchmark for what conviction looks like.”\n\nManaging your own morale—and your team’s morale—is one of the greatest challenges of most endeavors. It’s almost impossible without a lot of self-belief. And unfortunately, the more ambitious you are, the more the world will try to tear you down.\n\nMost highly successful people have been really right about the future at least once at a time when people thought they were wrong. If not, they would have faced much more competition.\n\nSelf-belief must be balanced with self-awareness. I used to hate criticism of any sort and actively avoided it. Now I try to always listen to it with the assumption that it’s true, and then decide if I want to act on it or not. Truth-seeking is hard and often painful, but it is what separates self-belief from self-delusion.\n\nThis balance also helps you avoid coming across as entitled and out of touch.\n\n**3\\. Learn to think independently**\n\nEntrepreneurship is very difficult to teach because original thinking is very difficult to teach. School is not set up to teach this—in fact, it generally rewards the opposite. So you have to cultivate it on your own.\n\nThinking from first principles and trying to generate new ideas is fun, and finding people to exchange them with is a great way to get better at this. The next step is to find easy, fast ways to test these ideas in the real world.\n\n“I will fail many times, and I will be really right once” is the entrepreneurs’ way. You have to give yourself a lot of chances to get lucky.\n\nOne of the most powerful lessons to learn is that you can figure out what to do in situations that seem to have no solution. The more times you do this, the more you will believe it. Grit comes from learning you can get back up after you get knocked down.\n\n**4\\. Get good at “sales”**\n\nSelf-belief alone is not sufficient—you also have to be able to convince other people of what you believe.\n\nAll great careers, to some degree, become sales jobs. You have to evangelize your plans to customers, prospective employees, the press, investors, etc. This requires an inspiring vision, strong communication skills, some degree of charisma, and evidence of execution ability.\n\nGetting good at communication—particularly written communication—is an investment worth making. My best advice for communicating clearly is to first make sure your thinking is clear and then use plain, concise language.\n\nThe best way to be good at sales is to genuinely believe in what you’re selling. Selling what you truly believe in feels great, and trying to sell snake oil feels awful.\n\nGetting good at sales is like improving at any other skill—anyone can get better at it with deliberate practice. But for some reason, perhaps because it feels distasteful, many people treat it as something unlearnable.\n\nMy other big sales tip is to show up in person whenever it’s important. When I was first starting out, I was always willing to get on a plane. It was frequently unnecessary, but three times it led to career-making turning points for me that otherwise would have gone the other way.\n\n**5\\. Make it easy to take risks**\n\nMost people overestimate risk and underestimate reward. Taking risks is important because it’s impossible to be right all the time—you have to try many things and adapt quickly as you learn more.\n\nIt’s often easier to take risks early in your career; you don’t have much to lose, and you potentially have a lot to gain. Once you’ve gotten yourself to a point where you have your basic obligations covered you should try to make it easy to take risks. Look for small bets you can make where you lose 1x if you’re wrong but make 100x if it works. Then make a bigger bet in that direction.\n\nDon’t save up for too long, though. At YC, we’ve often noticed a problem with founders that have spent a lot of time working at Google or Facebook. When people get used to a comfortable life, a predictable job, and a reputation of succeeding at whatever they do, it gets very hard to leave that behind (and people have an incredible ability to always match their lifestyle to next year’s salary). Even if they do leave, the temptation to return is great. It’s easy—and human nature—to prioritize short-term gain and convenience over long-term fulfillment.\n\nBut when you aren’t on the treadmill, you can follow your hunches and spend time on things that might turn out to be really interesting. Keeping your life cheap and flexible for as long as you can is a powerful way to do this, but obviously comes with tradeoffs.\n\n**6\\. Focus**\n\nFocus is a force multiplier on work.\n\nAlmost everyone I’ve ever met would be well-served by spending more time thinking about what to focus on. It is much more important to work on the right thing than it is to work many hours. Most people waste most of their time on stuff that doesn’t matter.\n\nOnce you have figured out what to do, be unstoppable about getting your small handful of priorities accomplished quickly. I have yet to meet a slow-moving person who is very successful.\n\n**7\\. Work hard**\n\nYou can get to about the 90th percentile in your field by working either smart or hard, which is still a great accomplishment. But getting to the 99th percentile requires both—you will be competing with other very talented people who will have great ideas and be willing to work a lot.\n\nExtreme people get extreme results. Working a lot comes with huge life trade-offs, and it’s perfectly rational to decide not to do it. But it has a lot of advantages. As in most cases, momentum compounds, and success begets success.\n\nAnd it’s often really fun. One of the great joys in life is finding your purpose, excelling at it, and discovering that your impact matters to something larger than yourself. A YC founder recently expressed great surprise about how much happier and more fulfilled he was after leaving his job at a big company and working towards his maximum possible impact. Working hard at that should be celebrated.\n\nIt’s not entirely clear to me why working hard has become a Bad Thing in certain parts of the US, but this is certainly not the case in other parts of the world—the amount of energy and drive exhibited by entrepreneurs outside of the US is quickly becoming the new benchmark.\n\nYou have to figure out how to work hard without burning out. People find their own strategies for this, but one that almost always works is to find work you like doing with people you enjoy spending a lot of time with.\n\nI think people who pretend you can be super successful professionally without working most of the time (for some period of your life) are doing a disservice. In fact, work stamina seems to be one of the biggest predictors of long-term success.\n\nOne more thought about working hard: do it at the beginning of your career. Hard work compounds like interest, and the earlier you do it, the more time you have for the benefits to pay off. It’s also easier to work hard when you have fewer other responsibilities, which is frequently but not always the case when you’re young.\n\n**8\\. Be bold**\n\nI believe that it’s easier to do a hard startup than an easy startup. People want to be part of something exciting and feel that their work matters.\n\nIf you are making progress on an important problem, you will have a constant tailwind of people wanting to help you. Let yourself grow more ambitious, and don’t be afraid to work on what you really want to work on.\n\nIf everyone else is starting meme companies, and you want to start a gene-editing company, then do that and don’t second guess it.\n\nFollow your curiosity. Things that seem exciting to you will often seem exciting to other people too.\n\n**9\\. Be willful**\n\nA big secret is that you can bend the world to your will a surprising percentage of the time—most people don’t even try, and just accept that things are the way that they are.\n\nPeople have an enormous capacity to make things happen. A combination of self-doubt, giving up too early, and not pushing hard enough prevents most people from ever reaching anywhere near their potential.\n\nAsk for what you want. You usually won’t get it, and often the rejection will be painful. But when this works, it works surprisingly well.\n\nAlmost always, the people who say “I am going to keep going until this works, and no matter what the challenges are I’m going to figure them out”, and mean it, go on to succeed. They are persistent long enough to give themselves a chance for luck to go their way.\n\nAirbnb is my benchmark for this. There are so many stories they tell that I wouldn’t recommend trying to reproduce (keeping maxed-out credit cards in those nine-slot three-ring binder pages kids use for baseball cards, eating dollar store cereal for every meal, battle after battle with powerful entrenched interest, and on and on) but they managed to survive long enough for luck to go their way.\n\nTo be willful, you have to be optimistic—hopefully this is a personality trait that can be improved with practice. I have never met a very successful pessimistic person.\n\n**10\\. Be hard to compete with**\n\nMost people understand that companies are more valuable if they are difficult to compete with. This is important, and obviously true.\n\nBut this holds true for you as an individual as well. If what you do can be done by someone else, it eventually will be, and for less money.\n\nThe best way to become difficult to compete with is to build up leverage. For example, you can do it with personal relationships, by building a strong personal brand, or by getting good at the intersection of multiple different fields. There are many other strategies, but you have to figure out some way to do it.\n\nMost people do whatever most people they hang out with do. This mimetic behavior is usually a mistake—if you’re doing the same thing everyone else is doing, you will not be hard to compete with.\n\n**11\\. Build a network**\n\nGreat work requires teams. Developing a network of talented people to work with—sometimes closely, sometimes loosely—is an essential part of a great career. The size of the network of really talented people you know often becomes the limiter for what you can accomplish.\n\nAn effective way to build a network is to help people as much as you can. Doing this, over a long period of time, is what lead to most of my best career opportunities and three of my four best investments. I’m continually surprised how often something good happens to me because of something I did to help a founder ten years ago.\n\nOne of the best ways to build a network is to develop a reputation for really taking care of the people who work with you. Be overly generous with sharing the upside; it will come back to you 10x. Also, learn how to evaluate what people are great at, and put them in those roles. (This is the most important thing I have learned about management, and I haven’t read much about it.) You want to have a reputation for pushing people hard enough that they accomplish more than they thought they could, but not so hard they burn out.\n\nEveryone is better at some things than others. Define yourself by your strengths, not your weaknesses. Acknowledge your weaknesses and figure out how to work around them, but don’t let them stop you from doing what you want to do. “I can’t do X because I’m not good at Y” is something I hear from entrepreneurs surprisingly often, and almost always reflects a lack of creativity. The best way to make up for your weaknesses is to hire complementary team members instead of just hiring people who are good at the same things you are.\n\nA particularly valuable part of building a network is to get good at discovering undiscovered talent. Quickly spotting intelligence, drive, and creativity gets much easier with practice. The easiest way to learn is just to meet a lot of people, and keep track of who goes on to impress you and who doesn’t. Remember that you are mostly looking for rate of improvement, and don’t overvalue experience or current accomplishment.\n\nI try to always ask myself when I meet someone new “is this person a force of nature?” It’s a pretty good heuristic for finding people who are likely to accomplish great things.\n\nA special case of developing a network is finding someone eminent to take a bet on you, ideally early in your career. The best way to do this, no surprise, is to go out of your way to be helpful. (And remember that you have to pay this forward at some point later!)\n\nFinally, remember to spend your time with positive people who support your ambitions.\n\n**12\\. You get rich by owning things**\n\nThe biggest economic misunderstanding of my childhood was that people got rich from high salaries. Though there are some exceptions—entertainers for example —almost no one in the history of the Forbes list has gotten there with a salary.\n\nYou get truly rich by owning things that increase rapidly in value.\n\nThis can be a piece of a business, real estate, natural resource, intellectual property, or other similar things. But somehow or other, you need to own equity in something, instead of just selling your time. Time only scales linearly.\n\nThe best way to make things that increase rapidly in value is by making things people want at scale.\n\n**13\\. Be internally driven**\n\nMost people are primarily externally driven; they do what they do because they want to impress other people. This is bad for many reasons, but here are two important ones.\n\nFirst, you will work on consensus ideas and on consensus career tracks.  You will care a lot—much more than you realize—if other people think you’re doing the right thing. This will probably prevent you from doing truly interesting work, and even if you do, someone else would have done it anyway.\n\nSecond, you will usually get risk calculations wrong. You’ll be very focused on keeping up with other people and not falling behind in competitive games, even in the short term.\n\nSmart people seem to be especially at risk of such externally-driven behavior. Being aware of it helps, but only a little—you will likely have to work super-hard to not fall in the mimetic trap.\n\nThe most successful people I know are primarily internally driven; they do what they do to impress themselves and because they feel compelled to make something happen in the world. After you’ve made enough money to buy whatever you want and gotten enough social status that it stops being fun to get more, this is the only force I know of that will continue to drive you to higher levels of performance.\n\nThis is why the question of a person’s motivation is so important. It’s the first thing I try to understand about someone. The right motivations are hard to define a set of rules for, but you know it when you see it.\n\nJessica Livingston and Paul Graham are my benchmarks for this. YC was widely mocked for the first few years, and almost no one thought it would be a big success when they first started. But they thought it would be great for the world if it worked, and they love helping people, and they were convinced their new model was better than the existing model.\n\nEventually, you will define your success by performing excellent work in areas that are important to you. The sooner you can start off in that direction, the further you will be able to go. It is hard to be wildly successful at anything you aren’t obsessed with.\n\n\n\\[1\\] A comment response I wrote on HN:\n\nOne of the biggest reasons I'm excited about basic income is the amount of human potential it will unleash by freeing more people to take risks.\n\nUntil then, if you aren't born lucky, you have to claw your way up for awhile before you can take big swings. If you are born in extreme poverty, then this is super difficult :(\n\nIt is obviously an incredible shame and waste that opportunity is so unevenly distributed. But I've witnessed enough people be born with the deck stacked badly against them and go on to incredible success to know it's possible.\n\nI am deeply aware of the fact that I personally would not be where I am if I weren't born incredibly lucky.\n\n\n\n\nThanks to Brian Armstrong, Greg Brockman, Dalton Caldwell, Diane von Furstenberg, Maddie Hall, Drew Houston, Vinod Khosla, Jessica Livingston, Jon Levy, Luke Miles (6 drafts!), Michael Moritz, Ali Rowghani, Michael Seibel, Peter Thiel, Tracy Young and Shivon Zilis for reviewing drafts of this, and thanks especially to Lachy Groom for help writing it.",
        "metadata": {
          "url": "https://blog.samaltman.com/how-to-be-successful",
          "platform": "medium",
          "title": "How To Be Successful",
          "author": null,
          "date": null,
          "excerpt": "I’ve observed thousands of founders and thought a lot about what it takes to make a huge amount of money or to create something important. Usually, people start off wanting the former and end up...",
          "categories": [],
          "tags": [],
          "member_only": false,
          "topics": []
        },
        "output_path": "../../docs/minds/sam_altman/sources/downloads/blogs/how-to-be-successful.md",
        "validation": {
          "score": 70,
          "acceptable": true,
          "issues": [
            "Missing author and date",
            "Low markdown quality: 40"
          ],
          "markdownQuality": {
            "score": 40,
            "wordCount": 3436,
            "lineCount": 193,
            "hasHeadings": false,
            "hasLinks": false,
            "hasFrontmatter": false,
            "issues": [
              "No headings found",
              "Excessive whitespace found"
            ],
            "acceptable": false
          }
        }
      },
      "error": null,
      "started_at": 1760223433001,
      "completed_at": 1760223433785,
      "duration": 784
    },
    {
      "id": "T1-002",
      "type": "blog",
      "source": {
        "id": "T1-002",
        "title": "The Intelligence Age",
        "type": "blog",
        "url": "https://ia.samaltman.com/",
        "tier": 1,
        "priority": "CRITICAL",
        "estimated_pages": 4,
        "temporal_period": "OpenAI CEO (2024)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760223433014,
      "updated_at": 1760223433968,
      "result": {
        "source_id": "T1-002",
        "platform": "generic",
        "markdown": "---\ntitle: \"The Intelligence Age\"\nurl: https://ia.samaltman.com/\nplatform: generic\nsource_type: blog\nextracted: 2025-10-11T22:57:13.968Z\nextraction_method: generic\n---\n\n*\\[Image: A vibrant, impressionistic landscape of a winding path that stretches towards the horizon, lined with colorful fields\\]*\n\nIn the next couple of decades, we will be able to do things that would have seemed like magic to our grandparents.\n\nThis phenomenon is not new, but it will be newly accelerated. People have become dramatically more capable over time; we can already accomplish things now that our predecessors would have believed to be impossible.\n\nWe are more capable not because of genetic change, but because we benefit from the infrastructure of society being way smarter and more capable than any one of us; in an important sense, society itself is a form of advanced intelligence. Our grandparents – and the generations that came before them – built and achieved great things. They contributed to the scaffolding of human progress that we all benefit from. AI will give people tools to solve hard problems and help us add new struts to that scaffolding that we couldn’t have figured out on our own. The story of progress will continue, and our children will be able to do things we can’t.\n\nIt won’t happen all at once, but we’ll soon be able to work with AI that helps us accomplish much more than we ever could without AI; eventually we can each have a personal AI team, full of virtual experts in different areas, working together to create almost anything we can imagine. Our children will have virtual tutors who can provide personalized instruction in any subject, in any language, and at whatever pace they need. We can imagine similar ideas for better healthcare, the ability to create any kind of software someone can imagine, and much more.\n\nWith these new abilities, we can have shared prosperity to a degree that seems unimaginable today; in the future, everyone’s lives can be better than anyone’s life is now. Prosperity alone doesn’t necessarily make people happy – there are plenty of miserable rich people – but it would meaningfully improve the lives of people around the world.\n\nHere is one narrow way to look at human history: after thousands of years of compounding scientific discovery and technological progress, we have figured out how to melt sand, add some impurities, arrange it with astonishing precision at extraordinarily tiny scale into computer chips, run energy through it, and end up with systems capable of creating increasingly capable artificial intelligence.\n\nThis may turn out to be the most consequential fact about all of history so far. It is possible that we will have superintelligence in a few thousand days (!); it may take longer, but I’m confident we’ll get there.\n\nHow did we get to the doorstep of the next leap in prosperity?\n\nIn three words: deep learning worked.\n\nIn 15 words: deep learning worked, got predictably better with scale, and we dedicated increasing resources to it.\n\nThat’s really it; humanity discovered an algorithm that could really, truly learn any distribution of data (or really, the underlying “rules” that produce any distribution of data). To a shocking degree of precision, the more compute and data available, the better it gets at helping people solve hard problems. I find that no matter how much time I spend thinking about this, I can never really internalize how consequential it is.\n\nThere are a lot of details we still have to figure out, but it’s a mistake to get distracted by any particular challenge. Deep learning works, and we will solve the remaining problems. We can say a lot of things about what may happen next, but the main one is that AI is going to get better with scale, and that will lead to meaningful improvements to the lives of people around the world.\n\nAI models will soon serve as autonomous personal assistants who carry out specific tasks on our behalf like coordinating medical care on your behalf. At some point further down the road, AI systems are going to get so good that they help us make better next-generation systems and make scientific progress across the board.\n\nTechnology brought us from the Stone Age to the Agricultural Age and then to the Industrial Age. From here, the path to the Intelligence Age is paved with compute, energy, and human will.\n\nIf we want to put AI into the hands of as many people as possible, we need to drive down the cost of compute and make it abundant (which requires lots of energy and chips). If we don’t build enough infrastructure, AI will be a very limited resource that wars get fought over and that becomes mostly a tool for rich people.\n\nWe need to act wisely but with conviction. The dawn of the Intelligence Age is a momentous development with very complex and extremely high-stakes challenges. It will not be an entirely positive story, but the upside is so tremendous that we owe it to ourselves, and the future, to figure out how to navigate the risks in front of us.\n\nI believe the future is going to be so bright that no one can do it justice by trying to write about it now; a defining characteristic of the Intelligence Age will be massive prosperity.\n\nAlthough it will happen incrementally, astounding triumphs – fixing the climate, establishing a space colony, and the discovery of all of physics – will eventually become commonplace. With nearly-limitless intelligence and abundant energy – the ability to generate great ideas, and the ability to make them happen – we can do quite a lot.\n\nAs we have seen with other technologies, there will also be downsides, and we need to start working now to maximize AI’s benefits while minimizing its harms. As one example, we expect that this technology can cause a significant change in labor markets (good and bad) in the coming years, but most jobs will change more slowly than most people think, and I have no fear that we’ll run out of things to do (even if they don’t look like “real jobs” to us today). People have an innate desire to create and to be useful to each other, and AI will allow us to amplify our own abilities like never before. As a society, we will be back in an expanding world, and we can again focus on playing positive-sum games.\n\nMany of the jobs we do today would have looked like trifling wastes of time to people a few hundred years ago, but nobody is looking back at the past, wishing they were a lamplighter. If a lamplighter could see the world today, he would think the prosperity all around him was unimaginable. And if we could fast-forward a hundred years from today, the prosperity all around us would feel just as unimaginable.",
        "metadata": {
          "url": "https://ia.samaltman.com/",
          "platform": "generic",
          "title": "The Intelligence Age",
          "author": null,
          "excerpt": "In the next couple of decades, we will be able to do things that would have seemed like magic to our grandparents.",
          "length": 6328,
          "site_name": null,
          "extraction_method": "readability"
        },
        "output_path": "../../docs/minds/sam_altman/sources/downloads/blogs/the-intelligence-age.md",
        "validation": {
          "score": 70,
          "acceptable": true,
          "issues": [
            "Missing author and date",
            "Low markdown quality: 40"
          ],
          "markdownQuality": {
            "score": 40,
            "wordCount": 1127,
            "lineCount": 41,
            "hasHeadings": false,
            "hasLinks": false,
            "hasFrontmatter": false,
            "issues": [
              "No headings found"
            ],
            "acceptable": false
          }
        }
      },
      "error": null,
      "started_at": 1760223433014,
      "completed_at": 1760223433968,
      "duration": 954
    },
    {
      "id": "T1-002",
      "type": "blog",
      "source": {
        "id": "T1-002",
        "title": "The Intelligence Age",
        "type": "blog",
        "url": "https://ia.samaltman.com/",
        "tier": 1,
        "priority": "CRITICAL",
        "estimated_pages": 4,
        "temporal_period": "OpenAI CEO (2024)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760225666580,
      "updated_at": 1760225667455,
      "result": {
        "source_id": "T1-002",
        "platform": "generic",
        "markdown": "---\ntitle: \"The Intelligence Age\"\nurl: https://ia.samaltman.com/\nplatform: generic\nsource_type: blog\nextracted: 2025-10-11T23:34:27.452Z\nextraction_method: generic\n---\n\n*\\[Image: A vibrant, impressionistic landscape of a winding path that stretches towards the horizon, lined with colorful fields\\]*\n\nIn the next couple of decades, we will be able to do things that would have seemed like magic to our grandparents.\n\nThis phenomenon is not new, but it will be newly accelerated. People have become dramatically more capable over time; we can already accomplish things now that our predecessors would have believed to be impossible.\n\nWe are more capable not because of genetic change, but because we benefit from the infrastructure of society being way smarter and more capable than any one of us; in an important sense, society itself is a form of advanced intelligence. Our grandparents – and the generations that came before them – built and achieved great things. They contributed to the scaffolding of human progress that we all benefit from. AI will give people tools to solve hard problems and help us add new struts to that scaffolding that we couldn’t have figured out on our own. The story of progress will continue, and our children will be able to do things we can’t.\n\nIt won’t happen all at once, but we’ll soon be able to work with AI that helps us accomplish much more than we ever could without AI; eventually we can each have a personal AI team, full of virtual experts in different areas, working together to create almost anything we can imagine. Our children will have virtual tutors who can provide personalized instruction in any subject, in any language, and at whatever pace they need. We can imagine similar ideas for better healthcare, the ability to create any kind of software someone can imagine, and much more.\n\nWith these new abilities, we can have shared prosperity to a degree that seems unimaginable today; in the future, everyone’s lives can be better than anyone’s life is now. Prosperity alone doesn’t necessarily make people happy – there are plenty of miserable rich people – but it would meaningfully improve the lives of people around the world.\n\nHere is one narrow way to look at human history: after thousands of years of compounding scientific discovery and technological progress, we have figured out how to melt sand, add some impurities, arrange it with astonishing precision at extraordinarily tiny scale into computer chips, run energy through it, and end up with systems capable of creating increasingly capable artificial intelligence.\n\nThis may turn out to be the most consequential fact about all of history so far. It is possible that we will have superintelligence in a few thousand days (!); it may take longer, but I’m confident we’ll get there.\n\nHow did we get to the doorstep of the next leap in prosperity?\n\nIn three words: deep learning worked.\n\nIn 15 words: deep learning worked, got predictably better with scale, and we dedicated increasing resources to it.\n\nThat’s really it; humanity discovered an algorithm that could really, truly learn any distribution of data (or really, the underlying “rules” that produce any distribution of data). To a shocking degree of precision, the more compute and data available, the better it gets at helping people solve hard problems. I find that no matter how much time I spend thinking about this, I can never really internalize how consequential it is.\n\nThere are a lot of details we still have to figure out, but it’s a mistake to get distracted by any particular challenge. Deep learning works, and we will solve the remaining problems. We can say a lot of things about what may happen next, but the main one is that AI is going to get better with scale, and that will lead to meaningful improvements to the lives of people around the world.\n\nAI models will soon serve as autonomous personal assistants who carry out specific tasks on our behalf like coordinating medical care on your behalf. At some point further down the road, AI systems are going to get so good that they help us make better next-generation systems and make scientific progress across the board.\n\nTechnology brought us from the Stone Age to the Agricultural Age and then to the Industrial Age. From here, the path to the Intelligence Age is paved with compute, energy, and human will.\n\nIf we want to put AI into the hands of as many people as possible, we need to drive down the cost of compute and make it abundant (which requires lots of energy and chips). If we don’t build enough infrastructure, AI will be a very limited resource that wars get fought over and that becomes mostly a tool for rich people.\n\nWe need to act wisely but with conviction. The dawn of the Intelligence Age is a momentous development with very complex and extremely high-stakes challenges. It will not be an entirely positive story, but the upside is so tremendous that we owe it to ourselves, and the future, to figure out how to navigate the risks in front of us.\n\nI believe the future is going to be so bright that no one can do it justice by trying to write about it now; a defining characteristic of the Intelligence Age will be massive prosperity.\n\nAlthough it will happen incrementally, astounding triumphs – fixing the climate, establishing a space colony, and the discovery of all of physics – will eventually become commonplace. With nearly-limitless intelligence and abundant energy – the ability to generate great ideas, and the ability to make them happen – we can do quite a lot.\n\nAs we have seen with other technologies, there will also be downsides, and we need to start working now to maximize AI’s benefits while minimizing its harms. As one example, we expect that this technology can cause a significant change in labor markets (good and bad) in the coming years, but most jobs will change more slowly than most people think, and I have no fear that we’ll run out of things to do (even if they don’t look like “real jobs” to us today). People have an innate desire to create and to be useful to each other, and AI will allow us to amplify our own abilities like never before. As a society, we will be back in an expanding world, and we can again focus on playing positive-sum games.\n\nMany of the jobs we do today would have looked like trifling wastes of time to people a few hundred years ago, but nobody is looking back at the past, wishing they were a lamplighter. If a lamplighter could see the world today, he would think the prosperity all around him was unimaginable. And if we could fast-forward a hundred years from today, the prosperity all around us would feel just as unimaginable.",
        "metadata": {
          "url": "https://ia.samaltman.com/",
          "platform": "generic",
          "title": "The Intelligence Age",
          "author": null,
          "excerpt": "In the next couple of decades, we will be able to do things that would have seemed like magic to our grandparents.",
          "length": 6328,
          "site_name": null,
          "extraction_method": "readability"
        },
        "output_path": "../../docs/minds/sam_altman/sources/downloads/blogs/the-intelligence-age.md",
        "validation": {
          "score": 70,
          "acceptable": true,
          "issues": [
            "Missing author and date",
            "Low markdown quality: 40"
          ],
          "markdownQuality": {
            "score": 40,
            "wordCount": 1127,
            "lineCount": 41,
            "hasHeadings": false,
            "hasLinks": false,
            "hasFrontmatter": false,
            "issues": [
              "No headings found"
            ],
            "acceptable": false
          }
        }
      },
      "error": null,
      "started_at": 1760225666580,
      "completed_at": 1760225667455,
      "duration": 875
    },
    {
      "id": "T1-001",
      "type": "blog",
      "source": {
        "id": "T1-001",
        "title": "How to Be Successful",
        "type": "blog",
        "url": "https://blog.samaltman.com/how-to-be-successful",
        "tier": 1,
        "priority": "CRITICAL",
        "estimated_pages": 3,
        "temporal_period": "YC President (2019)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760225666569,
      "updated_at": 1760225667869,
      "result": {
        "source_id": "T1-001",
        "platform": "medium",
        "markdown": "---\ntitle: \"How To Be Successful\"\nurl: https://blog.samaltman.com/how-to-be-successful\nplatform: medium\nsource_type: blog\nextracted: 2025-10-11T23:34:27.868Z\nextraction_method: medium\n---\n\nI’ve observed thousands of founders and thought a lot about what it takes to make a huge amount of money or to create something important. Usually, people start off wanting the former and end up wanting the latter.\n\nHere are 13 thoughts about how to achieve such outlier success. Everything here is easier to do once you’ve already reached a baseline degree of success (through privilege or effort) and want to put in the work to turn that into outlier success. \\[1\\] But much of it applies to anyone.\n\n**1\\. Compound yourself**\n\nCompounding is magic. Look for it everywhere. Exponential curves are the key to wealth generation.\n\nA medium-sized business that grows 50% in value every year becomes huge in a very short amount of time. Few businesses in the world have true network effects and extreme scalability. But with technology, more and more will.  It’s worth a lot of effort to find them and create them.\n\nYou also want to be an exponential curve yourself—you should aim for your life to follow an ever-increasing up-and-to-the-right trajectory. It’s important to move towards a career that has a compounding effect—most careers progress fairly linearly.\n\nYou don't want to be in a career where people who have been doing it for two years can be as effective as people who have been doing it for twenty—your rate of learning should always be high. As your career progresses, each unit of work you do should generate more and more results. There are many ways to get this leverage, such as capital, technology, brand, network effects, and managing people.\n\nIt’s useful to focus on adding another zero to whatever you define as your success metric—money, status, impact on the world, or whatever. I am willing to take as much time as needed between projects to find my next thing. But I always want it to be a project that, if successful, will make the rest of my career look like a footnote.\n\nMost people get bogged down in linear opportunities. Be willing to let small opportunities go to focus on potential step changes.\n\nI think the biggest competitive advantage in business—either for a company or for an individual’s career—is long-term thinking with a broad view of how different systems in the world are going to come together. One of the notable aspects of compound growth is that the furthest out years are the most important. In a world where almost no one takes a truly long-term view, the market richly rewards those who do.\n\nTrust the exponential, be patient, and be pleasantly surprised.\n\n**2\\. Have almost too much self-belief**\n\nSelf-belief is immensely powerful. The most successful people I know believe in themselves almost to the point of delusion.\n\nCultivate this early. As you get more data points that your judgment is good and you can consistently deliver results, trust yourself more.\n\nIf you don’t believe in yourself, it’s hard to let yourself have contrarian ideas about the future. But this is where most value gets created.\n\nI remember when Elon Musk took me on a tour of the SpaceX factory many years ago. He talked in detail about manufacturing every part of the rocket, but the thing that sticks in memory was the look of absolute certainty on his face when he talked about sending large rockets to Mars. I left thinking “huh, so that’s the benchmark for what conviction looks like.”\n\nManaging your own morale—and your team’s morale—is one of the greatest challenges of most endeavors. It’s almost impossible without a lot of self-belief. And unfortunately, the more ambitious you are, the more the world will try to tear you down.\n\nMost highly successful people have been really right about the future at least once at a time when people thought they were wrong. If not, they would have faced much more competition.\n\nSelf-belief must be balanced with self-awareness. I used to hate criticism of any sort and actively avoided it. Now I try to always listen to it with the assumption that it’s true, and then decide if I want to act on it or not. Truth-seeking is hard and often painful, but it is what separates self-belief from self-delusion.\n\nThis balance also helps you avoid coming across as entitled and out of touch.\n\n**3\\. Learn to think independently**\n\nEntrepreneurship is very difficult to teach because original thinking is very difficult to teach. School is not set up to teach this—in fact, it generally rewards the opposite. So you have to cultivate it on your own.\n\nThinking from first principles and trying to generate new ideas is fun, and finding people to exchange them with is a great way to get better at this. The next step is to find easy, fast ways to test these ideas in the real world.\n\n“I will fail many times, and I will be really right once” is the entrepreneurs’ way. You have to give yourself a lot of chances to get lucky.\n\nOne of the most powerful lessons to learn is that you can figure out what to do in situations that seem to have no solution. The more times you do this, the more you will believe it. Grit comes from learning you can get back up after you get knocked down.\n\n**4\\. Get good at “sales”**\n\nSelf-belief alone is not sufficient—you also have to be able to convince other people of what you believe.\n\nAll great careers, to some degree, become sales jobs. You have to evangelize your plans to customers, prospective employees, the press, investors, etc. This requires an inspiring vision, strong communication skills, some degree of charisma, and evidence of execution ability.\n\nGetting good at communication—particularly written communication—is an investment worth making. My best advice for communicating clearly is to first make sure your thinking is clear and then use plain, concise language.\n\nThe best way to be good at sales is to genuinely believe in what you’re selling. Selling what you truly believe in feels great, and trying to sell snake oil feels awful.\n\nGetting good at sales is like improving at any other skill—anyone can get better at it with deliberate practice. But for some reason, perhaps because it feels distasteful, many people treat it as something unlearnable.\n\nMy other big sales tip is to show up in person whenever it’s important. When I was first starting out, I was always willing to get on a plane. It was frequently unnecessary, but three times it led to career-making turning points for me that otherwise would have gone the other way.\n\n**5\\. Make it easy to take risks**\n\nMost people overestimate risk and underestimate reward. Taking risks is important because it’s impossible to be right all the time—you have to try many things and adapt quickly as you learn more.\n\nIt’s often easier to take risks early in your career; you don’t have much to lose, and you potentially have a lot to gain. Once you’ve gotten yourself to a point where you have your basic obligations covered you should try to make it easy to take risks. Look for small bets you can make where you lose 1x if you’re wrong but make 100x if it works. Then make a bigger bet in that direction.\n\nDon’t save up for too long, though. At YC, we’ve often noticed a problem with founders that have spent a lot of time working at Google or Facebook. When people get used to a comfortable life, a predictable job, and a reputation of succeeding at whatever they do, it gets very hard to leave that behind (and people have an incredible ability to always match their lifestyle to next year’s salary). Even if they do leave, the temptation to return is great. It’s easy—and human nature—to prioritize short-term gain and convenience over long-term fulfillment.\n\nBut when you aren’t on the treadmill, you can follow your hunches and spend time on things that might turn out to be really interesting. Keeping your life cheap and flexible for as long as you can is a powerful way to do this, but obviously comes with tradeoffs.\n\n**6\\. Focus**\n\nFocus is a force multiplier on work.\n\nAlmost everyone I’ve ever met would be well-served by spending more time thinking about what to focus on. It is much more important to work on the right thing than it is to work many hours. Most people waste most of their time on stuff that doesn’t matter.\n\nOnce you have figured out what to do, be unstoppable about getting your small handful of priorities accomplished quickly. I have yet to meet a slow-moving person who is very successful.\n\n**7\\. Work hard**\n\nYou can get to about the 90th percentile in your field by working either smart or hard, which is still a great accomplishment. But getting to the 99th percentile requires both—you will be competing with other very talented people who will have great ideas and be willing to work a lot.\n\nExtreme people get extreme results. Working a lot comes with huge life trade-offs, and it’s perfectly rational to decide not to do it. But it has a lot of advantages. As in most cases, momentum compounds, and success begets success.\n\nAnd it’s often really fun. One of the great joys in life is finding your purpose, excelling at it, and discovering that your impact matters to something larger than yourself. A YC founder recently expressed great surprise about how much happier and more fulfilled he was after leaving his job at a big company and working towards his maximum possible impact. Working hard at that should be celebrated.\n\nIt’s not entirely clear to me why working hard has become a Bad Thing in certain parts of the US, but this is certainly not the case in other parts of the world—the amount of energy and drive exhibited by entrepreneurs outside of the US is quickly becoming the new benchmark.\n\nYou have to figure out how to work hard without burning out. People find their own strategies for this, but one that almost always works is to find work you like doing with people you enjoy spending a lot of time with.\n\nI think people who pretend you can be super successful professionally without working most of the time (for some period of your life) are doing a disservice. In fact, work stamina seems to be one of the biggest predictors of long-term success.\n\nOne more thought about working hard: do it at the beginning of your career. Hard work compounds like interest, and the earlier you do it, the more time you have for the benefits to pay off. It’s also easier to work hard when you have fewer other responsibilities, which is frequently but not always the case when you’re young.\n\n**8\\. Be bold**\n\nI believe that it’s easier to do a hard startup than an easy startup. People want to be part of something exciting and feel that their work matters.\n\nIf you are making progress on an important problem, you will have a constant tailwind of people wanting to help you. Let yourself grow more ambitious, and don’t be afraid to work on what you really want to work on.\n\nIf everyone else is starting meme companies, and you want to start a gene-editing company, then do that and don’t second guess it.\n\nFollow your curiosity. Things that seem exciting to you will often seem exciting to other people too.\n\n**9\\. Be willful**\n\nA big secret is that you can bend the world to your will a surprising percentage of the time—most people don’t even try, and just accept that things are the way that they are.\n\nPeople have an enormous capacity to make things happen. A combination of self-doubt, giving up too early, and not pushing hard enough prevents most people from ever reaching anywhere near their potential.\n\nAsk for what you want. You usually won’t get it, and often the rejection will be painful. But when this works, it works surprisingly well.\n\nAlmost always, the people who say “I am going to keep going until this works, and no matter what the challenges are I’m going to figure them out”, and mean it, go on to succeed. They are persistent long enough to give themselves a chance for luck to go their way.\n\nAirbnb is my benchmark for this. There are so many stories they tell that I wouldn’t recommend trying to reproduce (keeping maxed-out credit cards in those nine-slot three-ring binder pages kids use for baseball cards, eating dollar store cereal for every meal, battle after battle with powerful entrenched interest, and on and on) but they managed to survive long enough for luck to go their way.\n\nTo be willful, you have to be optimistic—hopefully this is a personality trait that can be improved with practice. I have never met a very successful pessimistic person.\n\n**10\\. Be hard to compete with**\n\nMost people understand that companies are more valuable if they are difficult to compete with. This is important, and obviously true.\n\nBut this holds true for you as an individual as well. If what you do can be done by someone else, it eventually will be, and for less money.\n\nThe best way to become difficult to compete with is to build up leverage. For example, you can do it with personal relationships, by building a strong personal brand, or by getting good at the intersection of multiple different fields. There are many other strategies, but you have to figure out some way to do it.\n\nMost people do whatever most people they hang out with do. This mimetic behavior is usually a mistake—if you’re doing the same thing everyone else is doing, you will not be hard to compete with.\n\n**11\\. Build a network**\n\nGreat work requires teams. Developing a network of talented people to work with—sometimes closely, sometimes loosely—is an essential part of a great career. The size of the network of really talented people you know often becomes the limiter for what you can accomplish.\n\nAn effective way to build a network is to help people as much as you can. Doing this, over a long period of time, is what lead to most of my best career opportunities and three of my four best investments. I’m continually surprised how often something good happens to me because of something I did to help a founder ten years ago.\n\nOne of the best ways to build a network is to develop a reputation for really taking care of the people who work with you. Be overly generous with sharing the upside; it will come back to you 10x. Also, learn how to evaluate what people are great at, and put them in those roles. (This is the most important thing I have learned about management, and I haven’t read much about it.) You want to have a reputation for pushing people hard enough that they accomplish more than they thought they could, but not so hard they burn out.\n\nEveryone is better at some things than others. Define yourself by your strengths, not your weaknesses. Acknowledge your weaknesses and figure out how to work around them, but don’t let them stop you from doing what you want to do. “I can’t do X because I’m not good at Y” is something I hear from entrepreneurs surprisingly often, and almost always reflects a lack of creativity. The best way to make up for your weaknesses is to hire complementary team members instead of just hiring people who are good at the same things you are.\n\nA particularly valuable part of building a network is to get good at discovering undiscovered talent. Quickly spotting intelligence, drive, and creativity gets much easier with practice. The easiest way to learn is just to meet a lot of people, and keep track of who goes on to impress you and who doesn’t. Remember that you are mostly looking for rate of improvement, and don’t overvalue experience or current accomplishment.\n\nI try to always ask myself when I meet someone new “is this person a force of nature?” It’s a pretty good heuristic for finding people who are likely to accomplish great things.\n\nA special case of developing a network is finding someone eminent to take a bet on you, ideally early in your career. The best way to do this, no surprise, is to go out of your way to be helpful. (And remember that you have to pay this forward at some point later!)\n\nFinally, remember to spend your time with positive people who support your ambitions.\n\n**12\\. You get rich by owning things**\n\nThe biggest economic misunderstanding of my childhood was that people got rich from high salaries. Though there are some exceptions—entertainers for example —almost no one in the history of the Forbes list has gotten there with a salary.\n\nYou get truly rich by owning things that increase rapidly in value.\n\nThis can be a piece of a business, real estate, natural resource, intellectual property, or other similar things. But somehow or other, you need to own equity in something, instead of just selling your time. Time only scales linearly.\n\nThe best way to make things that increase rapidly in value is by making things people want at scale.\n\n**13\\. Be internally driven**\n\nMost people are primarily externally driven; they do what they do because they want to impress other people. This is bad for many reasons, but here are two important ones.\n\nFirst, you will work on consensus ideas and on consensus career tracks.  You will care a lot—much more than you realize—if other people think you’re doing the right thing. This will probably prevent you from doing truly interesting work, and even if you do, someone else would have done it anyway.\n\nSecond, you will usually get risk calculations wrong. You’ll be very focused on keeping up with other people and not falling behind in competitive games, even in the short term.\n\nSmart people seem to be especially at risk of such externally-driven behavior. Being aware of it helps, but only a little—you will likely have to work super-hard to not fall in the mimetic trap.\n\nThe most successful people I know are primarily internally driven; they do what they do to impress themselves and because they feel compelled to make something happen in the world. After you’ve made enough money to buy whatever you want and gotten enough social status that it stops being fun to get more, this is the only force I know of that will continue to drive you to higher levels of performance.\n\nThis is why the question of a person’s motivation is so important. It’s the first thing I try to understand about someone. The right motivations are hard to define a set of rules for, but you know it when you see it.\n\nJessica Livingston and Paul Graham are my benchmarks for this. YC was widely mocked for the first few years, and almost no one thought it would be a big success when they first started. But they thought it would be great for the world if it worked, and they love helping people, and they were convinced their new model was better than the existing model.\n\nEventually, you will define your success by performing excellent work in areas that are important to you. The sooner you can start off in that direction, the further you will be able to go. It is hard to be wildly successful at anything you aren’t obsessed with.\n\n\n\\[1\\] A comment response I wrote on HN:\n\nOne of the biggest reasons I'm excited about basic income is the amount of human potential it will unleash by freeing more people to take risks.\n\nUntil then, if you aren't born lucky, you have to claw your way up for awhile before you can take big swings. If you are born in extreme poverty, then this is super difficult :(\n\nIt is obviously an incredible shame and waste that opportunity is so unevenly distributed. But I've witnessed enough people be born with the deck stacked badly against them and go on to incredible success to know it's possible.\n\nI am deeply aware of the fact that I personally would not be where I am if I weren't born incredibly lucky.\n\n\n\n\nThanks to Brian Armstrong, Greg Brockman, Dalton Caldwell, Diane von Furstenberg, Maddie Hall, Drew Houston, Vinod Khosla, Jessica Livingston, Jon Levy, Luke Miles (6 drafts!), Michael Moritz, Ali Rowghani, Michael Seibel, Peter Thiel, Tracy Young and Shivon Zilis for reviewing drafts of this, and thanks especially to Lachy Groom for help writing it.",
        "metadata": {
          "url": "https://blog.samaltman.com/how-to-be-successful",
          "platform": "medium",
          "title": "How To Be Successful",
          "author": null,
          "date": null,
          "excerpt": "I’ve observed thousands of founders and thought a lot about what it takes to make a huge amount of money or to create something important. Usually, people start off wanting the former and end up...",
          "categories": [],
          "tags": [],
          "member_only": false,
          "topics": []
        },
        "output_path": "../../docs/minds/sam_altman/sources/downloads/blogs/how-to-be-successful.md",
        "validation": {
          "score": 70,
          "acceptable": true,
          "issues": [
            "Missing author and date",
            "Low markdown quality: 40"
          ],
          "markdownQuality": {
            "score": 40,
            "wordCount": 3436,
            "lineCount": 193,
            "hasHeadings": false,
            "hasLinks": false,
            "hasFrontmatter": false,
            "issues": [
              "No headings found",
              "Excessive whitespace found"
            ],
            "acceptable": false
          }
        }
      },
      "error": null,
      "started_at": 1760225666569,
      "completed_at": 1760225667869,
      "duration": 1300
    },
    {
      "id": "T1-003",
      "type": "blog",
      "source": {
        "id": "T1-003",
        "title": "Moore's Law for Everything",
        "type": "blog",
        "url": "https://moores.samaltman.com/",
        "tier": 1,
        "priority": "CRITICAL",
        "estimated_pages": 6,
        "temporal_period": "OpenAI CEO (2021)"
      },
      "status": "completed",
      "attempts": 0,
      "created_at": 1760225666581,
      "updated_at": 1760225668722,
      "result": {
        "source_id": "T1-003",
        "platform": "generic",
        "markdown": "---\ntitle: \"Moore's Law for Everything\"\nurl: https://moores.samaltman.com/\nauthor: by Sam Altman · March 16, 2021\nplatform: generic\nsource_type: blog\nextracted: 2025-10-11T23:34:28.720Z\nextraction_method: generic\n---\n\nMy work at OpenAI reminds me every day about the magnitude of the socioeconomic change that is coming sooner than most people believe. Software that can think and learn will do more and more of the work that people now do. Even more power will shift from labor to capital. If public policy doesn’t adapt accordingly, most people will end up worse off than they are today.\n\nWe need to design a system that embraces this technological future and taxes the assets that will make up most of the value in that world–companies and land–in order to fairly distribute some of the coming wealth. Doing so can make the society of the future much less divisive and enable everyone to participate in its gains.\n\nIn the next five years, computer programs that can think will read legal documents and give medical advice. In the next decade, they will do assembly-line work and maybe even become companions. And in the decades after that, they will do almost everything, including making new scientific discoveries that will expand our concept of “everything.”\n\nThis technological revolution is unstoppable. And a recursive loop of innovation, as these smart machines themselves help us make smarter machines, will accelerate the revolution’s pace. Three crucial consequences follow:\n\n1. This revolution will create phenomenal wealth. The price of many kinds of labor (which drives the costs of goods and services) will fall toward zero once sufficiently powerful AI “joins the workforce.”\n\n2. The world will change so rapidly and drastically that an equally drastic change in policy will be needed to distribute this wealth and enable more people to pursue the life they want.\n\n3. If we get both of these right, we can improve the standard of living for people more than we ever have before.\n\n\nBecause we are at the beginning of this tectonic shift, we have a rare opportunity to pivot toward the future. That pivot can’t simply address current social and political problems; it must be designed for the radically different society of the near future. Policy plans that don’t account for this imminent transformation will fail for the same reason that the organizing principles of pre-agrarian or feudal societies would fail today.\n\nWhat follows is a description of what’s coming and a plan for how to navigate this new landscape.\n\nPart 1\n\n## The AI Revolution\n\nOn a zoomed-out time scale, technological progress follows an exponential curve. Compare how the world looked 15 years ago (no smartphones, really), 150 years ago (no combustion engine, no home electricity), 1,500 years ago (no industrial machines), and 15,000 years ago (no agriculture).\n\nThe coming change will center around the most impressive of our capabilities: the phenomenal ability to think, create, understand, and reason. To the three great technological revolutions–the agricultural, the industrial, and the computational–we will add a fourth: the AI revolution. This revolution will generate enough wealth for everyone to have what they need, if we as a society manage it responsibly.\n\nThe technological progress we make in the next 100 years will be far larger than all we’ve made since we first controlled fire and invented the wheel. We have already built AI systems that can learn and do useful things. They are still primitive, but the trendlines are clear.\n\nPart 2\n\n## Moore's Law for Everything\n\nBroadly speaking, there are two paths to affording a good life: an individual acquires more money (which makes that person wealthier), or prices fall (which makes everyone wealthier). Wealth is buying power: how much we can get with the resources we have.\n\nThe best way to increase societal wealth is to decrease the cost of goods, from food to video games. Technology will rapidly drive that decline in many categories. Consider the example of semiconductors and Moore’s Law: for decades, chips became twice as powerful for the same price about every two years.\n\nIn the last couple of decades, costs in the US for TVs, computers, and entertainment have dropped. But other costs have risen significantly, most notably those for housing, healthcare, and higher education. Redistribution of wealth alone won’t work if these costs continue to soar.\n\nAI will lower the cost of goods and services, because labor is the driving cost at many levels of the supply chain. If robots can build a house on land you already own from natural resources mined and refined onsite, using solar power, the cost of building that house is close to the cost to rent the robots. And if those robots are made by other robots, the cost to rent them will be much less than it was when humans made them.\n\nSimilarly, we can imagine AI doctors that can diagnose health problems better than any human, and AI teachers that can diagnose and explain exactly what a student doesn’t understand.\n\n“Moore’s Law for everything” should be the rallying cry of a generation whose members can’t afford what they want. It sounds utopian, but it’s something technology can deliver (and in some cases already has). Imagine a world where, for decades, everything–housing, education, food, clothing, etc.–became half as expensive every two years.\n\nWe will discover new jobs–we always do after a technological revolution–and because of the abundance on the other side, we will have incredible freedom to be creative about what they are.\n\nPart 3\n\n## Capitalism for Everyone\n\nA stable economic system requires two components: growth and inclusivity. Economic growth matters because most people want their lives to improve every year. In a zero-sum world, one with no or very little growth, democracy can become antagonistic as people seek to vote money away from each other. What follows from that antagonism is distrust and polarization. In a high-growth world the dogfights can be far fewer, because it’s much easier for everyone to win.\n\nEconomic inclusivity means everyone having a reasonable opportunity to get the resources they need to live the life they want. Economic inclusivity matters because it’s fair, produces a stable society, and can create the largest slices of pie for the most people. As a side benefit, it produces more growth.\n\nCapitalism is a powerful engine of economic growth because it rewards people for investing in assets that generate value over time, which is an effective incentive system for creating and distributing technological gains. But the price of progress in capitalism is inequality.\n\nSome inequality is ok–in fact, it’s critical, as shown by all systems that have tried to be perfectly equal–but a society that does not offer sufficient equality of opportunity for everyone to advance is not a society that will last.\n\nThe traditional way to address inequality has been by progressively taxing income. For a variety of reasons, that hasn’t worked very well. It will work much, much worse in the future. While people will still have jobs, many of those jobs won’t be ones that create a lot of economic value in the way we think of value today. As AI produces most of the world’s basic goods and services, people will be freed up to spend more time with people they care about, care for people, appreciate art and nature, or work toward social good.\n\nWe should therefore focus on taxing capital rather than labor, and we should use these taxes as an opportunity to directly distribute ownership and wealth to citizens. In other words, the best way to improve capitalism is to enable everyone to benefit from it directly as an equity owner. This is not a new idea, but it will be newly feasible as AI grows more powerful, because there will be dramatically more wealth to go around. The two dominant sources of wealth will be 1) companies, particularly ones that make use of AI, and 2) land, which has a fixed supply.\n\nThere are many ways to implement these two taxes, and many thoughts about what to do with them. Over a long period of time, perhaps most other taxes could be eliminated. What follows is an idea in the spirit of a conversation starter.\n\nWe could do something called the American Equity Fund. The American Equity Fund would be capitalized by taxing companies above a certain valuation 2.5% of their market value each year, payable in shares transferred to the fund, and by taxing 2.5% of the value of all privately-held land, payable in dollars.\n\nAll citizens over 18 would get an annual distribution, in dollars and company shares, into their accounts. People would be entrusted to use the money however they needed or wanted—for better education, healthcare, housing, starting a company, whatever. Rising costs in government-funded industries would face real pressure as more people chose their own services in a competitive marketplace.\n\nAs long as the country keeps doing better, every citizen would get more money from the Fund every year (on average; there will still be economic cycles). Every citizen would therefore increasingly partake of the freedoms, powers, autonomies, and opportunities that come with economic self-determination. Poverty would be greatly reduced and many more people would have a shot at the life they want.\n\nA tax payable in company shares will align incentives between companies, investors, and citizens, whereas a tax on profits does not–incentives are superpowers, and this is a critical difference. Corporate profits can be disguised or deferred or offshored, and are often disconnected from share price. But everyone who owns a share in Amazon wants the share price to rise. As people’s individual assets rise in tandem with the country’s, they have a literal stake in seeing their country do well.\n\nHenry George, an American political economist, proposed the idea of a land-value tax in the late 1800s. The concept is widely supported by economists. The value of land appreciates because of the work society does around it: the network effects of the companies operating around a piece of land, the public transportation that makes it accessible, and the nearby restaurants, coffeeshops, and access to nature that makes it desirable. Because the landowner didn’t do all that work, it’s fair for that value to be shared with the larger society that did.\n\nIf everyone owns a slice of American value creation, everyone will want America to do better: collective equity in innovation and in the success of the country will align our incentives. The new social contract will be a floor for everyone in exchange for a ceiling for no one, and a shared belief that technology can and must deliver a virtuous circle of societal wealth. (We will continue to need strong leadership from our government to make sure that the desire for stock prices to go up remains balanced with protecting the environment, human rights, etc.)\n\nIn a world where everyone benefits from capitalism as an owner, the collective focus will be on making the world “more good” instead of “less bad.” These approaches are more different than they seem, and society does much better when it focuses on the former. Simply put, more good means optimizing for making the pie as large as possible, and less bad means dividing the pie up as fairly as possible. Both can increase people’s standard of living once, but continuous growth only happens when the pie grows.\n\nPart 4\n\n## Implementation and Troubleshooting\n\nThe amount of wealth available to capitalize the American Equity Fund would be significant. There is about $50 trillion worth of value, as measured by market capitalization, in US companies alone. Assume that, as it has on average over the past century, this will at least double over the next decade.\n\nThere is also about $30 trillion worth of privately-held land in the US (not counting improvements on top of the land). Assume that this value will roughly double, too, over the next decade–this is somewhat faster than the historical rate, but as the world really starts to understand the shifts AI will cause, the value of land, as one of the few truly finite assets, should increase at a faster rate.\n\nOf course, if we increase the tax burden on holding land, its value will diminish relative to other investment assets, which is a good thing for society because it makes a fundamental resource more accessible and encourages investment instead of speculation. The value of companies will diminish in the short-term, too, though they will continue to perform quite well over time.\n\nIt’s a reasonable assumption that such a tax causes a drop in value of land and corporate assets of 15% (which only will take a few years to recover!).\n\nUnder the above set of assumptions (current values, future growth, and the reduction in value from the new tax), a decade from now each of the 250 million adults in America would get about $13,500 every year. That dividend could be much higher if AI accelerates growth, but even if it’s not, $13,500 will have much greater purchasing power than it does now because technology will have greatly reduced the cost of goods and services. And that effective purchasing power will go up dramatically every year.\n\nIt would be easiest for companies to pay the tax each year by issuing new shares representing 2.5% of their value. There would obviously be an incentive for companies to escape the American Equity Fund tax by off-shoring themselves, but a simple test involving a percentage of revenue derived from America could address this concern. A larger problem with this idea is the incentive for companies to return value to shareholders instead of reinvesting it in growth.\n\nIf we tax only public companies, there would also be an incentive for companies to stay private. For private companies that have annual revenue in excess of $1 billion, we could let their tax in equity accrue for a certain (limited) number of years until they go public. If they remain private for a long time, we could let them settle the tax in cash.\n\nWe’d need to design the system to prevent people from consistently voting themselves more money. A constitutional amendment delineating the allowable ranges of the tax would be a strong safeguard. It is important that the tax not be so large that it stifles growth–for example, the tax on companies must be much smaller than their average growth rate.\n\nWe’d also need a robust system for quantifying the actual value of land. One way would be with a corps of powerful federal assessors. Another would be to let local governments do the assessing, as they now do to determine property taxes. They would continue to receive local taxes using the same assessed value. However, if a certain percentage of sales in a jurisdiction in any given year falls too far above or below the local government’s estimate of the property’s values, then all the other properties in their jurisdiction would be reassessed up or down.\n\nThe theoretically optimal system would be to tax the value of the land only, and not the improvements built on top of it. In practice, this value may turn out to be too difficult to assess, so we may need to tax the value of the land and the improvements on it (at a lower rate, as the combined value would be higher).\n\nFinally, we couldn’t let people borrow against, sell, or otherwise pledge their future Fund distributions, or we won’t really solve the problem of fairly distributing wealth over time. The government can simply make such transactions unenforceable.\n\nPart 5\n\n## Shifting to the New System\n\nA great future isn’t complicated: we need technology to create more wealth, and policy to fairly distribute it. Everything necessary will be cheap, and everyone will have enough money to be able to afford it. As this system will be enormously popular, policymakers who embrace it early will be rewarded: they will themselves become enormously popular.\n\nIn the Great Depression, Franklin Roosevelt was able to enact a huge social safety net that no one would have thought possible five years earlier. We are in a similar moment now. So a movement that is both pro-business and pro-people will unite a remarkably broad constituency.\n\nA politically feasible way to launch the American Equity Fund, and one that would reduce the transitional shock, would be with legislation that transitions us gradually to the 2.5% rates. The full 2.5% rate would only take hold once GDP increases by 50% from the time the law is passed. Starting with small distributions soon will be both motivating and helpful in getting people comfortable with a new future. Achieving 50% GDP growth sounds like it would take a long time (it took 13 years for the economy to grow 50% to its 2019 level). But once AI starts to arrive, growth will be extremely rapid. Down the line, we will probably be able to reduce a lot of other taxes as we tax these two fundamental asset classes.\n\nThe changes coming are unstoppable. If we embrace them and plan for them, we can use them to create a much fairer, happier, and more prosperous society. The future can be almost unimaginably great.\n\nThanks to Steven Adler, Daniela Amodei, Adam Baybutt, Chris Beiser, Jack Clark, Ryan Cohen, Tyler Cowen, Matt Danzeisen, Steve Dowling, Tad Friend, Lachy Groom, Chris Hallacy, Reid Hoffman, Ingmar Kanitscheider, Oleg Klimov, Matt Knight, Aris Konstantinidis, Andrew Kortina, Matt Krisiloff, Scott Krisiloff, John Luttig, Erik Madsen, Preston McAfee, Luke Miles, Arvind Neelakantan, David Oates, Cullen O’Keefe, Alethea Power, Raul Puri, Ilya Sutskever, Luke Walsh, Caleb Watney, and Wojchiech Zaremba for reviewing drafts of this, and to Gregory Koberger for designing it.",
        "metadata": {
          "url": "https://moores.samaltman.com/",
          "platform": "generic",
          "title": "Moore's Law for Everything",
          "author": "by Sam Altman · March 16, 2021",
          "excerpt": "We need to design a system that embraces this technological future and taxes the assets that will make up most of the value in that world–companies and land–in order to fairly distribute some of the coming wealth.",
          "length": 17418,
          "site_name": null,
          "extraction_method": "readability"
        },
        "output_path": "../../docs/minds/sam_altman/sources/downloads/blogs/moores-law-for-everything.md",
        "validation": {
          "score": 100,
          "acceptable": true,
          "issues": [],
          "markdownQuality": {
            "score": 70,
            "wordCount": 2912,
            "lineCount": 118,
            "hasHeadings": true,
            "hasLinks": false,
            "hasFrontmatter": false,
            "issues": [],
            "acceptable": true
          }
        }
      },
      "error": null,
      "started_at": 1760225666581,
      "completed_at": 1760225668722,
      "duration": 2141
    }
  ],
  "failed": [
    {
      "id": "T1-005",
      "type": "youtube",
      "source": {
        "id": "T1-005",
        "title": "Lex Fridman Podcast #367 - Sam Altman: OpenAI CEO on GPT-4, ChatGPT, and the Future of AI",
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=L_Guz73e6fw",
        "video_id": "L_Guz73e6fw",
        "tier": 1,
        "priority": "CRITICAL",
        "duration_minutes": 120,
        "temporal_period": "OpenAI CEO (March 2023)"
      },
      "status": "failed",
      "attempts": 3,
      "created_at": 1760221906954,
      "updated_at": 1760221946099,
      "result": null,
      "error": "Unhandled error. ({\n  source: {\n    id: 'T1-005',\n    title: 'Lex Fridman Podcast #367 - Sam Altman: OpenAI CEO on GPT-4, ChatGPT, and the Future of AI',\n    type: 'youtube',\n    url: 'https://www.youtube.com/watch?v=L_Guz73e6fw',\n    video_id: 'L_Guz73e6fw',\n    tier: 1,\n    priority: 'CRITICAL',\n    duration_minutes: 120,\n    temporal_period: 'OpenAI CEO (March 2023)',\n    cancelToken: { cancelled: false }\n  },\n  error: Error: Failed to download audio via yt-dlp: Command failed: yt-dlp --extract-audio --audio-format mp3 --audio-quality 0 -o \"/Users/oalanicolas/Documents/Code/mente_lendaria/docs/minds/sam_altman/sources/downloads/downloads/youtube/T1-005/audio.mp3\" --no-playlist --quiet --progress \"https://www.youtube.com/watch?v=L_Guz73e6fw\"\n  ERROR: unable to download video data: HTTP Error 403: Forbidden\n  \n      at YouTubeCollector._downloadAudio (file:///Users/oalanicolas/Documents/Code/mente_lendaria/expansion-packs/etl-data-collector/scripts/collectors/youtube-collector.js:204:13)\n      at async YouTubeCollector.collect (file:///Users/oalanicolas/Documents/Code/mente_lendaria/expansion-packs/etl-data-collector/scripts/collectors/youtube-collector.js:55:19)\n      at async Object.execute (file:///Users/oalanicolas/Documents/Code/mente_lendaria/expansion-packs/etl-data-collector/scripts/orchestrator/parallel-collector.js:99:20)\n      at async TaskManager._executeTask (file:///Users/oalanicolas/Documents/Code/mente_lendaria/expansion-packs/etl-data-collector/scripts/orchestrator/task-manager.js:119:22)\n})",
      "started_at": 1760221936416
    },
    {
      "id": "T1-006",
      "type": "youtube",
      "source": {
        "id": "T1-006",
        "title": "Lex Fridman Podcast #419 - Sam Altman: OpenAI, GPT-5, Sora, Board Saga, Elon Musk, Ilya, Power & AGI",
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=jvqFAi7vkBc",
        "video_id": "jvqFAi7vkBc",
        "tier": 1,
        "priority": "CRITICAL",
        "duration_minutes": 150,
        "temporal_period": "OpenAI CEO (March 2024)"
      },
      "status": "failed",
      "attempts": 3,
      "created_at": 1760221906954,
      "updated_at": 1760221948728,
      "result": null,
      "error": "Unhandled error. ({\n  source: {\n    id: 'T1-006',\n    title: 'Lex Fridman Podcast #419 - Sam Altman: OpenAI, GPT-5, Sora, Board Saga, Elon Musk, Ilya, Power & AGI',\n    type: 'youtube',\n    url: 'https://www.youtube.com/watch?v=jvqFAi7vkBc',\n    video_id: 'jvqFAi7vkBc',\n    tier: 1,\n    priority: 'CRITICAL',\n    duration_minutes: 150,\n    temporal_period: 'OpenAI CEO (March 2024)',\n    cancelToken: { cancelled: false }\n  },\n  error: Error: Failed to download audio via yt-dlp: Command failed: yt-dlp --extract-audio --audio-format mp3 --audio-quality 0 -o \"/Users/oalanicolas/Documents/Code/mente_lendaria/docs/minds/sam_altman/sources/downloads/downloads/youtube/T1-006/audio.mp3\" --no-playlist --quiet --progress \"https://www.youtube.com/watch?v=jvqFAi7vkBc\"\n  ERROR: unable to download video data: HTTP Error 403: Forbidden\n  \n      at YouTubeCollector._downloadAudio (file:///Users/oalanicolas/Documents/Code/mente_lendaria/expansion-packs/etl-data-collector/scripts/collectors/youtube-collector.js:204:13)\n      at async YouTubeCollector.collect (file:///Users/oalanicolas/Documents/Code/mente_lendaria/expansion-packs/etl-data-collector/scripts/collectors/youtube-collector.js:55:19)\n      at async Object.execute (file:///Users/oalanicolas/Documents/Code/mente_lendaria/expansion-packs/etl-data-collector/scripts/orchestrator/parallel-collector.js:99:20)\n      at async TaskManager._executeTask (file:///Users/oalanicolas/Documents/Code/mente_lendaria/expansion-packs/etl-data-collector/scripts/orchestrator/task-manager.js:119:22)\n})",
      "started_at": 1760221939443
    }
  ],
  "metrics": {
    "started": 16,
    "completed": 16,
    "failed": 2,
    "retried": 4,
    "cancelled": 0,
    "avgDuration": 2685
  },
  "dependencies": {}
}